
//&НаКлиенте
//Процедура СК_ОтгрузитьВместо(Команда)
//	
//	//Если ПроверитьКоличество() Тогда
//	//	
//	//Иначе
//	//	
//	//КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура СК_ТоварыНоменклатураПриИзмененииПосле(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	ТекущаяСтрока.ДоступноЯчейки = ОбновитьКолонкуДоступноЯчейкиСервер(ТекущаяСтрока.Номенклатура);

КонецПроцедуры

&НаСервере
Функция ОбновитьКолонкуДоступноЯчейкиСервер(Номенклатура)
	
	Попытка
		Возврат СК_ОстаткиЯчейки.ОстатокПоЯчейкам(Номенклатура).Итог("ВналичииОстаток");		
	Исключение
		Возврат 0;
	КонецПопытки;
	
КонецФункции	


