&НаСервере
Функция КонтрольУникальностиСправочникаПоРеквизиту(ИмяОбъекта, СтрРеквизитов, ЗначениеСсылка) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    Спр.Ссылка
    |ИЗ
    |    Справочник." + ИмяОбъекта + " КАК Спр
    |ГДЕ
    |    Спр.Ссылка <> &парЗначениеСсылка
    |";     
    Нум = 0;
    Для Каждого Знч Из СтрРеквизитов Цикл
        ИмяПараметраВЗапросе = " = &Пар" + Строка(Нум);
        Запрос.Текст = Запрос.Текст + " И Спр." + Знч.Ключ + ИмяПараметраВЗапросе; 
        Запрос.УстановитьПараметр("Пар" + Строка(Нум),    Знч.Значение);
        Нум = Нум + 1;
    КонецЦикла;    
    Запрос.УстановитьПараметр("парЗначениеСсылка",         ЗначениеСсылка);        
    РезультатЗапроса = Запрос.Выполнить();
        Возврат РезультатЗапроса.Пустой(); 
КонецФункции
