
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ГруппаЭтаж2; 
	ЗаполнитьСекцию("A2");
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСкладПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаЭтаж2" Тогда
		ЗаполнитьСекцию("A2");	
	ИначеЕсли ТекущаяСтраница.Имя = "ГруппаЭтаж1" Тогда
		ЗаполнитьСекцию("F2");	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ГруппаСтраницыЭтаж2ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ЗаполнитьСекцию(ТекущаяСтраница.Имя);
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьСекцию(имяСекции)
	ЭтаФорма["Этаж" + имяСекции] = ЗаполнитьСекциюНаСервере(имяСекции,"");	
КонецПроцедуры                                  

&НаСервере
Функция ЗаполнитьСекциюНаСервере(имяМакета,ШК)
	
	ДеревоРек = РеквизитФормыВЗначение("ТабЯчейки");
	ДеревоРек.Строки.Очистить();		
	
	ТаблДокум = Новый  ТабличныйДокумент;
	ТаблДокум.Очистить();  
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетЭтаж"+имяМакета); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка.Ячейка КАК ЯчейкаЯчейка,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка.ШтрихКод КАК ЯчейкаШтрихКод,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка.Ряд КАК ЯчейкаРяд,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка.Секция КАК ЯчейкаСекция
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |ГДЕ
	               //|	СК_ТоварыНаСкладахОстатки.Ячейка.Ряд = &Ряд
	               |	СК_ТоварыНаСкладахОстатки.Ячейка.Секция = &Секция";
	
	//Запрос.УстановитьПараметр("Ряд",Прав(имяМакета,1));
	Запрос.УстановитьПараметр("Секция",Лев(имяМакета,1));
	
	Рез = Запрос.Выполнить().Выгрузить(); 
	КолЯчеек = 24;
////

	Шапка = Макет.ПолучитьОбласть("Шапка"); 
	
	Если имяМакета = "F2" Тогда
			Ряд1 = Макет.ПолучитьОбласть("Строка1|ОбластьПраво");
			Ряд2 = Макет.ПолучитьОбласть("Строка1|ОбластьЛево");
			Ряд3 = Макет.ПолучитьОбласть("Строка2|ОбластьПраво");
			Ряд4 = Макет.ПолучитьОбласть("Строка2|ОбластьЛево");

			Ряд20 = Макет.ПолучитьОбласть("Строка1|ОбластьЛево1");
			Ряд10 = Макет.ПолучитьОбласть("Строка1|ОбластьПраво1");
			
			Отбор = Новый Структура;
			Отбор.Вставить("ЯчейкаРяд","0");
			Отбор.Вставить("ЯчейкаСекция","F"); 
			Отбор.Вставить("ЯчейкаЯчейка",2);

			Строки = Рез.НайтиСтроки(Отбор);
			Ряд20.Параметры.Ячейка2 = 2;
			Если Строки.Количество() >= 1 Тогда 
				Ряд20.Параметры.РЯчейка2  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;	
			//////////////
			Отбор.Вставить("ЯчейкаЯчейка",1);

			Строки = Рез.НайтиСтроки(Отбор);
			Ряд10.Параметры.Ячейка1 = 1;
			Если Строки.Количество() >= 1 Тогда 
				Ряд10.Параметры.РЯчейка1  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;	
			
			

	ИначеЕсли имяМакета = "G2" Тогда
			//Ряд02 = Макет.ПолучитьОбласть("Строка1|ОбластьЛево0");
			
			Отбор = Новый Структура;
			Отбор.Вставить("ЯчейкаСекция","G"); 

			Ряд2 = Макет.ПолучитьОбласть("Строка1|ОбластьЛево"); 
			
			Ряд0 = Макет.ПолучитьОбласть("Строка1|ОбластьЛево1");
			Ряд01 = Макет.ПолучитьОбласть("Строка1|ОбластьПраво1");

			Отбор.Вставить("ЯчейкаРяд","0");
			Отбор.Вставить("ЯчейкаЯчейка",2);

			Строки = Рез.НайтиСтроки(Отбор);
			Ряд0.Параметры.Ячейка2 = 2;
			Если Строки.Количество() >= 1 Тогда 
				Ряд0.Параметры.РЯчейка2  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;	
			Отбор.Вставить("ЯчейкаЯчейка",1);

			Строки = Рез.НайтиСтроки(Отбор);
			Ряд01.Параметры.Ячейка1 = 1;
			Если Строки.Количество() >= 1 Тогда 
				Ряд01.Параметры.РЯчейка1  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;	
 			Ряд2 = Макет.ПолучитьОбласть("Строка1|ОбластьЛево");
			Ряд1 = Макет.ПолучитьОбласть("Строка1|ОбластьПраво");
			Ряд3 = Макет.ПолучитьОбласть("Строка2|ОбластьПраво");
			Ряд4 = Макет.ПолучитьОбласть("Строка2|ОбластьЛево");

			
	ИначеЕсли имяМакета = "H2" Тогда
			Ряд1 = Макет.ПолучитьОбласть("Строка1|ОбластьПраво");
			Ряд2 = Макет.ПолучитьОбласть("Строка1|ОбластьЛево");
			Ряд3 = Макет.ПолучитьОбласть("Строка2|ОбластьПраво");
			Ряд4 = Макет.ПолучитьОбласть("Строка2|ОбластьЛево");
		
			Ряд01 = Макет.ПолучитьОбласть("Строка1|ОбластьПраво1");
			Ряд02 = Макет.ПолучитьОбласть("Строка1|ОбластьЛево1");
			Ряд03 = Макет.ПолучитьОбласть("Строка2|ОбластьЛево1");
			
			Отбор = Новый Структура;
			Отбор.Вставить("ЯчейкаСекция","H"); 
			Отбор.Вставить("ЯчейкаРяд","0");
			Отбор.Вставить("ЯчейкаЯчейка",1);

			Строки = Рез.НайтиСтроки(Отбор);
			Ряд01.Параметры.Ячейка1 = 1;
			Если Строки.Количество() >= 1 Тогда 
				Ряд01.Параметры.РЯчейка1  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;
			
			Отбор.Вставить("ЯчейкаЯчейка",2);
			Строки = Рез.НайтиСтроки(Отбор);
			Ряд02.Параметры.Ячейка2 = 2;
			Если Строки.Количество() >= 1 Тогда 
				Ряд02.Параметры.РЯчейка2  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;	

			Отбор.Вставить("ЯчейкаЯчейка",3);
			Строки = Рез.НайтиСтроки(Отбор);
			Ряд03.Параметры.Ячейка3 = 3;
			Если Строки.Количество() >= 1 Тогда 
				Ряд03.Параметры.РЯчейка3  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;	
			


	ИначеЕсли имяМакета = "K2" Тогда
		КолЯчеек = 33;
		Ряд1 = Макет.ПолучитьОбласть("Строка1|ОбластьЛево");
		Ряд01 = Макет.ПолучитьОбласть("Строка1|ОбластьЛево1");
		Ряд3 = Макет.ПолучитьОбласть("Строка2|ОбластьЛево");
		Ряд02 = Макет.ПолучитьОбласть("Строка2|ОбластьЛево1");
		Ряд2 = Макет.ПолучитьОбласть("Строка2|ОбластьПраво");
			Отбор = Новый Структура;
			Отбор.Вставить("ЯчейкаСекция","K"); 
			Отбор.Вставить("ЯчейкаРяд","0");

			Отбор.Вставить("ЯчейкаЯчейка",1);
			Строки = Рез.НайтиСтроки(Отбор);
			Ряд01.Параметры.Ячейка1 = 1;
			Если Строки.Количество() >= 1 Тогда 
				Ряд01.Параметры.РЯчейка1  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;	

			Отбор.Вставить("ЯчейкаЯчейка",2);
			Строки = Рез.НайтиСтроки(Отбор);
			Ряд02.Параметры.Ячейка2 = 2;
			Если Строки.Количество() >= 1 Тогда 
				Ряд02.Параметры.РЯчейка2  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;	
			
	ИначеЕсли имяМакета = "L2" Тогда
		КолЯчеек = 34;
		Ряд1 = Макет.ПолучитьОбласть("Строка1|ОбластьЛево");
		Ряд01 = Макет.ПолучитьОбласть("Строка1|ОбластьЛево1");
		Ряд3 = Макет.ПолучитьОбласть("Строка2|ОбластьЛево");
		Ряд02 = Макет.ПолучитьОбласть("Строка2|ОбластьЛево0");
		Ряд2 = Макет.ПолучитьОбласть("Строка2|ОбластьПраво");
			Отбор = Новый Структура;
			Отбор.Вставить("ЯчейкаСекция","L"); 
			Отбор.Вставить("ЯчейкаРяд","0");

			Отбор.Вставить("ЯчейкаЯчейка",1);
			Строки = Рез.НайтиСтроки(Отбор);
			Ряд01.Параметры.Ячейка1 = 1;
			Если Строки.Количество() >= 1 Тогда 
				Ряд01.Параметры.РЯчейка1  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;	

			Отбор.Вставить("ЯчейкаЯчейка",2);
			Строки = Рез.НайтиСтроки(Отбор);
			Ряд02.Параметры.Ячейка2 = 2;
			Если Строки.Количество() >= 1 Тогда 
				Ряд02.Параметры.РЯчейка2  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;	
		
	ИначеЕсли имяМакета = "M2" Тогда
		КолЯчеек = 33;
		Ряд1 = Макет.ПолучитьОбласть("Строка1|ОбластьЛево");
		Ряд2 = Макет.ПолучитьОбласть("Строка2|ОбластьЛево");
		
	Иначе

		Если имяМакета = "D2" Тогда
			Ряд5 = Макет.ПолучитьОбласть("Строка3|ОбластьЛево");
			Ряд6 = Макет.ПолучитьОбласть("Строка3|ОбластьПраво");
			Ряд7 = Макет.ПолучитьОбласть("Строка4|ОбластьЛево");
		КонецЕсли;
			Ряд1 = Макет.ПолучитьОбласть("Строка1|ОбластьПраво");
			Ряд2 = Макет.ПолучитьОбласть("Строка1|ОбластьЛево");
			Ряд3 = Макет.ПолучитьОбласть("Строка2|ОбластьПраво");
			Ряд4 = Макет.ПолучитьОбласть("Строка2|ОбластьЛево");
	КонецЕсли;
	
	

	
	Для сч=0 По КолЯчеек Цикл

		Отбор = Новый Структура;
		Отбор.Вставить("ЯчейкаЯчейка",сч);
		Отбор.Вставить("ЯчейкаРяд","1");
		Отбор.Вставить("ЯчейкаСекция",Лев(имяМакета,1)); 
		Строки = Рез.НайтиСтроки(Отбор);
		
		Попытка
			Ряд1.Параметры["Ячейка"+сч] = сч;
			Если Строки.Количество() >= 1 Тогда 
				Ряд1.Параметры["РЯчейка"+сч]  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
///////////////////
		Отбор = Новый Структура;
		Отбор.Вставить("ЯчейкаЯчейка",сч);
		Отбор.Вставить("ЯчейкаРяд","2");
		Отбор.Вставить("ЯчейкаСекция",Лев(имяМакета,1)); 
		Строки = Рез.НайтиСтроки(Отбор);
		
		Попытка
			Ряд2.Параметры["Ячейка"+сч] = сч;
			Если Строки.Количество() >= 1 Тогда 
				Ряд2.Параметры["РЯчейка"+сч]  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
///////////////////
		Отбор = Новый Структура;
		Отбор.Вставить("ЯчейкаЯчейка",сч);
		Отбор.Вставить("ЯчейкаРяд","3");
		Отбор.Вставить("ЯчейкаСекция",Лев(имяМакета,1)); 
		Строки = Рез.НайтиСтроки(Отбор);
		
		Попытка
			Ряд3.Параметры["Ячейка"+сч] = сч;
			Если Строки.Количество() >= 1 Тогда 
				Ряд3.Параметры["РЯчейка"+сч]  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
///////////////////
		Отбор = Новый Структура;
		Отбор.Вставить("ЯчейкаЯчейка",сч);
		Отбор.Вставить("ЯчейкаРяд","4");
		Отбор.Вставить("ЯчейкаСекция",Лев(имяМакета,1)); 
		Строки = Рез.НайтиСтроки(Отбор);
		
		Попытка
			Ряд4.Параметры["Ячейка"+сч] = сч;
			Если Строки.Количество() >= 1 Тогда 
				Ряд4.Параметры["РЯчейка"+сч]  = Строка(Строки[0].ЯчейкаШтрихКод);
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
///////////////////////////////////////////
		Если имяМакета = "D2" Тогда

	///////////////////
			Отбор = Новый Структура;
			Отбор.Вставить("ЯчейкаЯчейка",сч);
			Отбор.Вставить("ЯчейкаРяд","5");
			Отбор.Вставить("ЯчейкаСекция",Лев(имяМакета,1)); 
			Строки = Рез.НайтиСтроки(Отбор);
			
			Попытка
				Ряд5.Параметры["Ячейка"+сч] = сч;
				Если Строки.Количество() >= 1 Тогда 
					Ряд5.Параметры["РЯчейка"+сч]  = Строка(Строки[0].ЯчейкаШтрихКод);
				КонецЕсли;	
			Исключение
			КонецПопытки;
			
	///////////////////
			Отбор = Новый Структура;
			Отбор.Вставить("ЯчейкаЯчейка",сч);
			Отбор.Вставить("ЯчейкаРяд","6");
			Отбор.Вставить("ЯчейкаСекция",Лев(имяМакета,1)); 
			Строки = Рез.НайтиСтроки(Отбор);
			
			Попытка
				Ряд6.Параметры["Ячейка"+сч] = сч;
				Если Строки.Количество() >= 1 Тогда 
					Ряд6.Параметры["РЯчейка"+сч]  = Строка(Строки[0].ЯчейкаШтрихКод);
				КонецЕсли;	
			Исключение
			КонецПопытки;
			
			///////////////////
			Отбор = Новый Структура;
			Отбор.Вставить("ЯчейкаЯчейка",сч);
			Отбор.Вставить("ЯчейкаРяд","7");
			Отбор.Вставить("ЯчейкаСекция",Лев(имяМакета,1)); 
			Строки = Рез.НайтиСтроки(Отбор);
			
			Попытка
				Ряд7.Параметры["Ячейка"+сч] = сч;
				Если Строки.Количество() >= 1 Тогда 
					Ряд7.Параметры["РЯчейка"+сч]  = Строка(Строки[0].ЯчейкаШтрихКод);
				КонецЕсли;	
			Исключение
			КонецПопытки;
			
			
		КонецЕсли;
///////////////////////////////////////////////

	КонецЦикла;

	ТаблДокум.Вывести(Шапка);
	Если имяМакета = "F2" Тогда
		ТаблДокум.Вывести(Ряд2);
		ТаблДокум.Присоединить(Ряд20); 
		ТаблДокум.Присоединить(Ряд1); 
		ТаблДокум.Присоединить(Ряд10); 
		ТаблДокум.Вывести(Ряд4);
		ТаблДокум.Присоединить(Ряд3);

	ИначеЕсли имяМакета = "G2" Тогда  
		ТаблДокум.Вывести(Ряд2);
		ТаблДокум.Присоединить(Ряд0);
		ТаблДокум.Присоединить(Ряд1); 
		ТаблДокум.Присоединить(Ряд01); 
		ТаблДокум.Вывести(Ряд4);
		ТаблДокум.Присоединить(Ряд3);

	ИначеЕсли имяМакета = "H2" Тогда
		ТаблДокум.Вывести(Ряд2);
		ТаблДокум.Присоединить(Ряд02);
		ТаблДокум.Присоединить(Ряд1); 
		ТаблДокум.Присоединить(Ряд01); 
		ТаблДокум.Вывести(Ряд4);
		ТаблДокум.Присоединить(Ряд03); 
		ТаблДокум.Присоединить(Ряд3);
		
	ИначеЕсли имяМакета = "K2" Тогда
		ТаблДокум.Вывести(Ряд1);
		ТаблДокум.Присоединить(Ряд01);
		ТаблДокум.Вывести(Ряд3);
		ТаблДокум.Присоединить(Ряд02); 
		ТаблДокум.Присоединить(Ряд2);
		
	ИначеЕсли имяМакета = "L2" Тогда
		ТаблДокум.Вывести(Ряд1);
		ТаблДокум.Присоединить(Ряд01);
		ТаблДокум.Вывести(Ряд02); 
		ТаблДокум.Присоединить(Ряд3);
		ТаблДокум.Присоединить(Ряд2);
		
	ИначеЕсли имяМакета = "M2" Тогда
		ТаблДокум.Вывести(Ряд1);
		ТаблДокум.Вывести(Ряд2); 
	Иначе
		ТаблДокум.Вывести(Ряд2);
		ТаблДокум.Присоединить(Ряд1); 
		ТаблДокум.Вывести(Ряд4);
		ТаблДокум.Присоединить(Ряд3);
		
		Если имяМакета = "D2" Тогда
			ТаблДокум.Вывести(Ряд5);
			ТаблДокум.Присоединить(Ряд6);
			ТаблДокум.Вывести(Ряд7);
		КонецЕсли;

	КонецЕсли;
	 Координат = 0;;
	 Для а = 1 по ТаблДокум.ВысотаТаблицы Цикл 
		Для б = 1 по ТаблДокум.ШиринаТаблицы Цикл
			 
			Если ТаблДокум.Область("R"+а+"C"+б).ЦветФона = Новый Цвет(51, 153, 102) ИЛИ ТаблДокум.Область("R"+а+"C"+б).ЦветФона = Новый Цвет(250, 204, 31) Тогда 
				Расшифровка = ТаблДокум.Область("R"+а+"C"+б).Расшифровка;
				Если стрДлина(Расшифровка) = 13 Тогда 
					Если Расшифровка = ШК Тогда
						Координат = "R"+а+"C"+б;
						ТаблДокум.Область("R"+а+"C"+б).ЦветФона = WebЦвета.Красный;	
					Иначе
						ТаблДокум.Область("R"+а+"C"+б).ЦветФона = Новый Цвет(51, 102, 255);	
					КонецЕсли;
					
				Иначе
						
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
	Если Координат <> 0 Тогда 
	//Координат = "R5C11";

    	ТаблДокум.Область(Координат).ЦветФона =  WebЦвета.Красный;
	КонецЕсли;
	
	Возврат ТаблДокум;
	
КонецФункции

&НаСервере
Процедура ОчиститьДерево() 
	ЭтаФорма.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	ДеревоРек = РеквизитФормыВЗначение("ТабЯчейки");
	ДеревоРек.Строки.Очистить();
	ЗначениеВРеквизитФормы(ДеревоРек,"ТабЯчейки");
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДеревоЯчейки(ШК)

	ДеревоРек = РеквизитФормыВЗначение("ТабЯчейки");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Различные
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка.Ячейка КАК Ячейка,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка КАК СКЯчейка
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	СК_ТоварыНаСкладахОстатки.Ячейка.ШтрихКод = &ШтрихКод";
	
	Запрос.УстановитьПараметр("ШтрихКод",СокрЛП(ШК));
	
	Рез = Запрос.Выполнить().Выгрузить();  
	
	Если Рез.Количество()>=1 Тогда
		Для сч=0 По Рез.Количество()-1 Цикл
			НоваяГруппа1 = ДеревоРек.Строки.Добавить();
			НоваяГруппа1.Номенклатура = Рез[сч].Номенклатура;
			НоваяГруппа1.Ячейка = Рез[сч].СКЯчейка;
			НоваяГруппа1.Остаток = Рез[сч].ВналичииОстаток; 
			
			Таб = СК_ОстаткиЯчейки.ОстатокПоЯчейкам(Рез[сч].Номенклатура);
			
			Если Таб.Количество()>=1 Тогда
				
				Для Каждого стр из Таб Цикл
					Если стр.Ячейка.ШтрихКод <> СокрЛП(ШК) Тогда
						НовыйЭлемент1 = НоваяГруппа1.Строки.Добавить();   	
						НовыйЭлемент1.Номенклатура =  стр.Номенклатура;
						НовыйЭлемент1.Ячейка =  стр.Ячейка;
						НовыйЭлемент1.Остаток =  стр.ВналичииОстаток;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			
		КонецЦикла;
		ЗначениеВРеквизитФормы(ДеревоРек,"ТабЯчейки") ;
	КонецЕсли;
	
	
	
КонецПроцедуры 


&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
	
	ДеревоРек = РеквизитФормыВЗначение("ТабЯчейки");
	ДеревоРек.Строки.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка.Ячейка КАК Ячейка,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка КАК СКЯчейка
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура",ЭтаФорма.Номенклатура);
	
	Рез = Запрос.Выполнить().Выгрузить();  
	
	Если Рез.Количество()>=1 Тогда
		Для сч=0 По Рез.Количество()-1 Цикл
			НоваяГруппа1 = ДеревоРек.Строки.Добавить();
			НоваяГруппа1.Номенклатура = Рез[сч].Номенклатура;
			НоваяГруппа1.Ячейка = Рез[сч].СКЯчейка;
			НоваяГруппа1.Остаток = Рез[сч].ВналичииОстаток; 
			
		КонецЦикла;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоРек,"ТабЯчейки") ;

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент) 
	НоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТабЯчейкиЯчейкаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТабЯчейкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	НН = ПолучитьСекцию(Элемент.ТекущиеДанные.Ячейка); 
	ШК = ПолучитьШКЯчейки(Элемент.ТекущиеДанные.Ячейка) ;
	ЭтаФорма.ТекущийЭлемент = 	Элементы.Найти(НН);
	ЭтаФорма["Этаж" + НН] = ЗаполнитьСекциюНаСервере(НН,ШК);	
КонецПроцедуры

&НаСервере
Функция ПолучитьСекцию(Ячейка) 
	ТЭ =  Строка(Ячейка.Секция)+ Строка(2) ;;
	Возврат  ТЭ;
КонецФункции 

&НаСервере
Функция ПолучитьШКЯчейки(Ячейка) 
	Возврат  Ячейка.ШтрихКод;
КонецФункции


&НаКлиенте
Процедура ЭтажA2Выбор(Элемент, Область, СтандартнаяОбработка)
	ОчиститьДерево();
КонецПроцедуры 

&НаКлиенте
Процедура ЭтажA2ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)

	СтандартнаяОбработка = Ложь;
	ЗаполнитьДеревоЯчейки(Расшифровка);

КонецПроцедуры

&НаКлиенте
Процедура ЭтажB2Выбор(Элемент, Область, СтандартнаяОбработка)
	ОчиститьДерево();
КонецПроцедуры 

&НаКлиенте
Процедура ЭтажB2ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	ЗаполнитьДеревоЯчейки(Расшифровка);

КонецПроцедуры


&НаКлиенте
Процедура ЭтажC3Выбор(Элемент, Область, СтандартнаяОбработка)
	ОчиститьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ЭтажC2ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ЗаполнитьДеревоЯчейки(Расшифровка);
КонецПроцедуры

&НаКлиенте
Процедура ЭтажD2Выбор(Элемент, Область, СтандартнаяОбработка)
	ОчиститьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ЭтажD2ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ЗаполнитьДеревоЯчейки(Расшифровка);
КонецПроцедуры

&НаКлиенте
Процедура ЭтажF2Выбор(Элемент, Область, СтандартнаяОбработка)
	ОчиститьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ЭтажF2ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ЗаполнитьДеревоЯчейки(Расшифровка);
КонецПроцедуры

&НаКлиенте
Процедура ЭтажG2Выбор(Элемент, Область, СтандартнаяОбработка)
	ОчиститьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ЭтажG2ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ЗаполнитьДеревоЯчейки(Расшифровка);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыЭтаж1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ЗаполнитьСекцию(ТекущаяСтраница.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭтажH2Выбор(Элемент, Область, СтандартнаяОбработка)
	ОчиститьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ЭтажH2ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ЗаполнитьДеревоЯчейки(Расшифровка);
КонецПроцедуры

&НаКлиенте
Процедура ЭтажK2Выбор(Элемент, Область, СтандартнаяОбработка)
	ОчиститьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ЭтажK2ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ЗаполнитьДеревоЯчейки(Расшифровка);
КонецПроцедуры

&НаКлиенте
Процедура ЭтажL2Выбор(Элемент, Область, СтандартнаяОбработка)
	ОчиститьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ЭтажL2ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ЗаполнитьДеревоЯчейки(Расшифровка);
КонецПроцедуры

&НаКлиенте
Процедура ЭтажM2Выбор(Элемент, Область, СтандартнаяОбработка)
	ОчиститьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ЭтажM2ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ЗаполнитьДеревоЯчейки(Расшифровка);
КонецПроцедуры








