
Процедура ПередЗаписью(Отказ)
    ИмяОбъекта = ЭтотОбъект.Метаданные().Имя;
    СтрРеквизитов = Новый Структура; //
    СтрРеквизитов.Вставить("Наименование", Наименование);
    Если Не ОбщегоНазначения.КонтрольУникальностиСправочникаПоРеквизиту(ИмяОбъекта, СтрРеквизитов, Ссылка) Тогда
        Сообщить("Подобный элемент справочника /" + Наименование + "/ существует!
                |Модуль: Контроль уникальности элементов справочника." );
        Отказ = Истина;
    КонецЕсли;

	//СтрРеквизитов = Новый Структура; //
	//СтрРеквизитов.Вставить("ШтрихКод", ШтрихКод);
	//Если Не ОбщегоНазначения.КонтрольУникальностиСправочникаПоРеквизиту(ИмяОбъекта, СтрРеквизитов, Ссылка) Тогда
	//    Сообщить("Подобный элемент справочника /" + Наименование + "/ существует!
	//            |Модуль: Контроль уникальности элементов справочника." );
	//    Отказ = Истина;
	//КонецЕсли;
КонецПроцедуры
