
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);

	
	ЭтаФорма.Элементы.Ячейка.Заголовок = "Ячейка не выбрана";
	ЭтаФорма.Элементы.Ячейка.ЦветТекста = WebЦвета.Кирпичный;
	

	Если СтруктураПараметров.Ссылка <> "" Тогда 
		ЗаполнитьТабТовары(СтруктураПараметров.Ссылка);
	Иначе
		Сообщить("Не удалось создать документ отгрузки");	
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьТабТовары(Док)
	
	ТабТовары.Очистить();
	
	СКСписание = НайтиДокСписания(Док);
	
	Если СКСписание.Пустая() = Истина Тогда
		НовыйДок = Документы.СК_СписаниеСклад.СоздатьДокумент();  
		НовыйДок.Дата = ТекущаяДата();
		НовыйДок.ДокументОснования = Док;
		НовыйДок.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран;
	Иначе
		НовыйДок = СКСписание.ПолучитьОбъект();
	КонецЕсли;
	
		ВТЧ = Док.Товары.Выгрузить();
		ВТЧ.Свернуть("Номенклатура","КоличествоУпаковок");
		НовыйДок.Товары.Загрузить(ВТЧ); 
	
	Попытка
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение); 
		Д = НовыйДок;
		ЭтаФорма.ДокОсн = Д.Ссылка;
	Исключение
		Сообщить("Не удалось создать документ отгрузки");	
	КонецПопытки;
	
	ОбновитьТабТовары();
	
КонецПроцедуры

&НаСервере
Функция НайтиДокСписания(Док)	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_СписаниеСклад.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СК_СписаниеСклад КАК СК_СписаниеСклад
	               |ГДЕ
	               |	СК_СписаниеСклад.ПометкаУдаления = &ПометкаУдаления
	               |	И СК_СписаниеСклад.Проведен = &Проведен
	               |	И СК_СписаниеСклад.ДокументОснования = &ДокументОснования";
	
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	Запрос.УстановитьПараметр("Проведен",Истина);
	Запрос.УстановитьПараметр("ДокументОснования",Док);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Документы.СК_СписаниеСклад.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СканQRИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПоискНоменклатурыШК(Текст); 
	
	Если ЭтаФорма.Номенклатура.Пустая() = Ложь Тогда
		ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
		АктивироватьПоискШКЯчейки();
		//ПодключитьОбработчикОжидания("АктивироватьПоискШКЯчейки",5,Истина);
	КонецЕсли;

	ЭтаФорма.СканQR = "";
	ЭтаФорма.Количество = 0;
	
КонецПроцедуры 

&НаСервере
Процедура ПоискНоменклатурыШК(ШК)  
	
	ЭтаФорма.Ячейка = Справочники.СК_Ячейки.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |		ПО РеализацияТоваровУслугТовары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	               |	И РеализацияТоваровУслугТовары.Ссылка.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Штрихкод",ШК);
	Запрос.УстановитьПараметр("Ссылка",ЭтаФорма.ДокОсн.ДокументОснования.Ссылка);
	Рез = Запрос.Выполнить().Выгрузить();

	Если Рез.Количество() >= 1 Тогда
		ЭтаФорма.Номенклатура = Рез[0].Номенклатура;
	///      
		Инф = "";
		ЗапросЯчейки = Новый Запрос;
		ЗапросЯчейки.Текст = "ВЫБРАТЬ
							 |	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
							 |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
							 |ИЗ
							 |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
							 |ГДЕ
							 |	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура";
		ЗапросЯчейки.УстановитьПараметр("Номенклатура", Рез[0].Номенклатура);
			//@skip-check query-in-loop
		РезЯч = ЗапросЯчейки.Выполнить().Выгрузить();

		Если РезЯч.Количество() >= 1 Тогда
			Инф = Инф + "Остатки по ячейкам:" + Символы.ПС;
			Для Каждого стр Из РезЯч Цикл
				Инф = Инф + Строка(стр.Ячейка) + " -  " + Строка(стр.ВналичииОстаток) + " "
					+ Рез[0].Номенклатура.ЕдиницаИзмерения + Символы.ПС;

			КонецЦикла;
		КонецЕсли;
		РезультатЗапросаУп = ЗапросЯчейки.Выполнить();

		ЭтаФорма.Ячейка = Справочники.СК_Ячейки.ПустаяСсылка();

		Список = Новый СписокЗначений;
		Список.Очистить();
		Список.ЗагрузитьЗначения(РезультатЗапросаУп.Выгрузить().ВыгрузитьКолонку("Ячейка"));
		ЭтаФорма.Элементы.ШКЯчейки.СписокВыбора.ЗагрузитьЗначения(Список.ВыгрузитьЗначения());
		ЭтаФорма.Элементы.Информация.Заголовок = Инф;
		ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "";
			
	////

		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Количество;
		ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "";
	Иначе
		ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "Номенклатура не найдена в документе";
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.СканQR;
	КонецЕсли;
	
КонецПроцедуры


///////////
&НаКлиенте
Процедура АктивироватьПоискШКЯчейки() 
	ОчиститьШКСерверШКЯчейки(); 
	Элементы.ШКЯчейки.ОбновитьТекстРедактирования();
	Элементы.ШКЯчейки.Видимость = Ложь;
	Элементы.ШКЯчейки.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКЯчейки; 
//	НачатьРедактированиеЭлемента();
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСерверШКЯчейки()
	ШКЯчейки = "";  
	СканQR = "";
КонецПроцедуры  

&НаСервере
Процедура ШКЯчейкиИзменениеТекстаРедактированияНаСервере(ШК)
	
	ЯчейкаПоиск = Справочники.СК_Ячейки.НайтиПоРеквизиту("ШтрихКод",СокрЛП(ШК)).Ссылка;
	
	ЭтаФорма.Ячейка = ЯчейкаПоиск;
	
	ЭтаФорма.Количество = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
	|	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	|ИЗ
	|	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	|ГДЕ
	|	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
	|	И СК_ТоварыНаСкладахОстатки.Ячейка = &Ячейка";
	Запрос.УстановитьПараметр("Номенклатура",ЭтаФорма.Номенклатура);
	Запрос.УстановитьПараметр("Ячейка",ЯчейкаПоиск); 
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Если Рез.ВналичииОстаток >=1 Тогда             
			ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Количество;
			ЭтаФорма.Элементы.ОшибкаНом.Заголовок =	"";
		Иначе
			ЭтаФорма.Ячейка = Справочники.СК_Ячейки.ПустаяСсылка();
			ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "В ячейке не хвататет товара";
			ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.СканQR;
		КонецЕсли;
	Иначе
			ЭтаФорма.Ячейка = Справочники.СК_Ячейки.ПустаяСсылка();
			ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "В ячейке не хвататет товара";
			ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.СканQR;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ШКЯчейкиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ШКЯчейкиИзменениеТекстаРедактированияНаСервере(Текст);
	ОчиститьШКСерверШКЯчейки();
КонецПроцедуры

&НаСервере
Функция СобратьНаСервере() 
	Ош = Истина;
	
	Если ЭтаФорма.Номенклатура.Ссылка.Пустая() =  Ложь И ЭтаФорма.Ячейка.Ссылка.Пустая() = Ложь И ЭтаФорма.Количество >=1 Тогда 
		ОтборСборки = Новый Структура;
		ОтборСборки.Вставить("Номенклатура",ЭтаФорма.Номенклатура);
		
		Док = ДокОсн.ПолучитьОбъект();
		
		////////////////
		СтрокиПоДок = Док.Товары.НайтиСтроки(ОтборСборки);
		
		КолПоДок = СтрокиПоДок[0].КоличествоУпаковок - СтрокиПоДок[0].Собран;
		
		ОстатокВЯчейке = ПолучитьОстаток(); 
		
		Если КолПоДок>=1 И КолПоДок>=ЭтаФорма.Количество И ЭтаФорма.Количество<= ОстатокВЯчейке Тогда
			ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "";
			
			
			Т = Док.СобранныеТовары.Добавить();
			Т.Номенклатура = ЭтаФорма.Номенклатура; 
			Т.Количество = ЭтаФорма.Количество; 
			Т.Ячейка = ЭтаФорма.Ячейка; 
			Т.ВремяНабора = ТекущаяДата();
			
			Док.Записать(РежимЗаписиДокумента.Проведение);
			////////////////
			ЭтаФорма.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
			ЭтаФорма.Ячейка = Справочники.СК_Ячейки.ПустаяСсылка(); 
			ЭтаФорма.Количество = 0;
			Ош = Ложь;
            ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.СканQR;

		Иначе
			ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "Количество превышает остаток";
		КонецЕсли;
		
	Иначе
		
		ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "Заполните корректно поля";
		ЭтаФорма.Ячейка = Справочники.СК_Ячейки.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат Ош;
	
КонецФункции
		
&НаСервере
Функция ПолучитьОстаток()
	
	Ост = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	|ИЗ
	|	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	|ГДЕ
	|	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
	|	И СК_ТоварыНаСкладахОстатки.Ячейка = &Ячейка";
	Запрос.УстановитьПараметр("Номенклатура",ЭтаФорма.Номенклатура);
	Запрос.УстановитьПараметр("Ячейка",ЭтаФорма.Ячейка); 
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Если Рез.ВналичииОстаток >=1 Тогда             
			Ост = Рез.ВналичииОстаток;
		КонецЕсли;
	КонецЕсли;

	Возврат Ост;
	
КонецФункции

&НаКлиенте
Процедура Собрать(Команда)
	
	К = СобратьНаСервере();
	
	Если К = Ложь Тогда
		ОбновитьТабТовары();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТабТовары()
	
	ТабТовары.Очистить();
	
	ВТЧТовары = ЭтаФорма.ДокОсн.Товары.Выгрузить();
	ВТЧТовары.Свернуть("Номенклатура","КоличествоУпаковок");
	ВТЧСобрано = ЭтаФорма.ДокОсн.СобранныеТовары.Выгрузить();
	ВТЧСобрано.Свернуть("Номенклатура","Количество");
	ТабТовары.Загрузить(ВТЧТовары);
	
	Для Каждого стр из ТабТовары Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",стр.Номенклатура);
		Строки = ВТЧСобрано.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда
			стр.КоличествоСобрано = Строки[0].Количество; 
			Если стр.КоличествоУпаковок = стр.КоличествоСобрано Тогда
				стр.Завершено = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Отбор = Новый Структура;
	Отбор.Вставить("Завершено",Ложь);
	
	ПСтроки = ТабТовары.НайтиСтроки(Отбор);
	Если ПСтроки.Количество() = 0 Тогда  
		Док = ДокОсн.ПолучитьОбъект();
		Если Док.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран Тогда 
			Док.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран;
			Док.Записать(РежимЗаписиДокумента.Проведение);  
		КонецЕсли;
		Если Док.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран Тогда 
        	ЭтаФорма.Элементы.ГруппаПоля.Доступность = Ложь;
		КонецЕсли;
		
		ЭтаФорма.Элементы.Собран.Заголовок = "Документ собран";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;  
	СтуктураВозврат.Вставить("ДокСборки", ДокОсн);  
	ОповеститьОВыборе(СтуктураВозврат); 
КонецПроцедуры

&НаКлиенте
Процедура ШКЯчейкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СЗУпаковкиПриИзмененииНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура СЗУпаковкиПриИзмененииНаСервере(Эл)  
	ЭтаФорма.Ячейка = Эл; 
КонецПроцедуры


&НаКлиенте
Процедура СканQRОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПоискНоменклатурыШК(Текст); 
	
	Если ЭтаФорма.Номенклатура.Пустая() = Ложь Тогда
		ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
		АктивироватьПоискШКЯчейки();
		//ПодключитьОбработчикОжидания("АктивироватьПоискШКЯчейки",5,Истина);
	КонецЕсли;

	ЭтаФорма.СканQR = "";
	ЭтаФорма.Количество = 0;
КонецПроцедуры


&НаСервере
Процедура ОтменитьСборкуНаСервере()
	Док = ЭтаФорма.ДокОсн.ПолучитьОбъект();
	Док.СобранныеТовары.Очистить();
	Док.Записать(РежимЗаписиДокумента.Проведение);
	ЭтаФорма.ТабТовары.Очистить();
КонецПроцедуры


&НаКлиенте
Процедура ОтменитьСборку(Команда)
	ОтменитьСборкуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТабТоварыКоличествоСобраноПриИзменении(Элемент)
	
	
КонецПроцедуры    

&НаСервере
Процедура УдалитьПозицию(Товар) 
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура",Товар); 

	ДокРеализации = ДокОсн.Ссылка.ДокументОснования.Ссылка.ПолучитьОбъект();
	
	СтрокиР = ДокРеализации.Товары.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаР Из СтрокиР Цикл 
		ДокРеализации.Товары.Удалить(СтрокаР); 
	КонецЦикла; 
	ДокРеализации.Записать(РежимЗаписиДокумента.Проведение);
	
	
	ДосСборки = ДокОсн.Ссылка.ПолучитьОбъект();
	
	Строки = ДосСборки.Товары.НайтиСтроки(Отбор);
	
	Для Каждого Строка Из Строки Цикл 
		ДосСборки.Товары.Удалить(Строка); 
	КонецЦикла; 
	
	СтрокиСобр = ДосСборки.СобранныеТовары.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаСобр Из СтрокиСобр Цикл 
		ДосСборки.СобранныеТовары.Удалить(СтрокаСобр); 
	КонецЦикла; 

	ДосСборки.Записать(РежимЗаписиДокумента.Проведение);
	ОбновитьТабТовары();
	
КонецПроцедуры 


&НаСервере
Функция ПроверитьСтатусСборки() 
	Если ЭтаФорма.ДокОсн.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ТабТоварыПередУдалением(Элемент, Отказ)
	УдалитьПозицию(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Номенклатура);
КонецПроцедуры



