
&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ДобаитьНаСервере()
	Т = ЭтаФорма.Таб.Добавить();
	Т.Номенклатура = ЭтаФорма.Номенклатура;
	Т.Количество = ЭтаФорма.Количество;
КонецПроцедуры

&НаКлиенте
Процедура Добаить(Команда)
	ДобаитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаданиеНаСервере()
	Док = Документы.СК_ЗаданиеНаПечать.СоздатьДокумент();  
	Док.Дата = ТекущаяДата();
	Док.Выполнено = Ложь; 
	//Док.СсылкаДокумент = Объект.Ссылка;
	ТЧ = ЭтаФорма.Таб.Выгрузить();
	Док.Товары.Загрузить(ТЧ);
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Ошибка записи");
	КонецПопытки;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадание(Команда)
	СоздатьЗаданиеНаСервере();  
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СканШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	НайтиВыбратьНоменклатуру(Текст); 
		ЭтаФорма.Элементы.Количество.РедактированиеТекста = Истина;

		ПодключитьОбработчикОжидания("АктивироватьКоличество",1,Истина);

КонецПроцедуры


&НаСервере
Процедура НайтиВыбратьНоменклатуру(ШК) 
	ЭтаФорма.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	Запрос.УстановитьПараметр("Штрихкод",ШК);  
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		ЭтаФорма.Номенклатура = Рез.Номенклатура;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура АктивироватьКоличество() 
	ОчиститьШКСерверШКЯчейки(); 
	Элементы.Количество.ОбновитьТекстРедактирования();
	Элементы.Количество.Видимость = Ложь;
	Элементы.Количество.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Количество; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСерверШКЯчейки()
	Количество = "";
КонецПроцедуры 