
Процедура ОбработкаПроведения(Отказ, Режим) 
 
	// регистр ТоварыНаСкладах Расход  
	Если СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран Тогда
		Движения.ТоварыНаСкладах.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл 
			ТОстаток = Обработки.СК_МобСклад.ПолучитьОстатокНоменклатураСклад(ТекСтрокаТовары.Номенклатура,Склад,Дата);
	 		Если ТОстаток>= ТекСтрокаТовары.Количество Тогда
				Движение = Движения.ТоварыНаСкладах.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
				Движение.Склад = Склад;
				Движение.ВНаличии = ТекСтрокаТовары.Количество;
			Иначе
				Сообщить("По товару " + Строка(ТекСтрокаТовары.Номенклатура)+ " не хватает количества");	
				Отказ = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ДокСписания = СК_ОбщийМодульЯчейки.ДокументСписание(ЭтотОбъект.Ссылка);
	Если ДокСписания <> Ложь Тогда
		ЭтотОбъект.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран; 
		Док = ДокСписания.ПолучитьОбъект();
		Док.Проведен = Ложь;
		Док.ПометкаУдаления = Истина;
		Док.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;

КонецПроцедуры

