
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
			ПараметрыФормыОстатки = Новый Структура; 
			ПараметрыФормыОстатки.Вставить("Ссылка",Элемент.ТекущиеДанные.Ссылка);
			АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
			_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
			ОткрытьФорму("Обработка.СК_МобСклад.Форма.ФормаРеализации", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.СканQR.РедактированиеТекста = Истина;
	АктивироватьПоиск();
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.СканQR.ОбновитьТекстРедактирования();
	Элементы.СканQR.Видимость = Ложь;
	Элементы.СканQR.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканQR; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	СканQR = "";
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Дата = ТекущаяДата();
	ЗаполнитьТЧ();
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьТЧ()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ПередачаТоваров.Дата КАК Дата,
	               |	СК_ПередачаТоваров.Номер КАК Номер,
	               |	СК_ПередачаТоваров.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СК_ПередачаТоваров КАК СК_ПередачаТоваров
	               |ГДЕ
	               |	СК_ПередачаТоваров.Проведен = Истина
	               |	И СК_ПередачаТоваров.СтатусСборки = ЗНАЧЕНИЕ(Перечисление.СК_СтатусСборкиРеализации.НеСобран)
	               |	И СК_ПередачаТоваров.ПометкаУдаления = Ложь";
	Рез = Запрос.Выполнить().Выгрузить();
	
	СписокДок.Очистить();
	СписокДок.Загрузить(Рез);
КонецПроцедуры

&НаКлиенте
Процедура СканQRИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если СтрНайти(Текст, ";") = 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Отсканируйте сборочный лист",10,"Внимание!!!");
	Иначе
		Д = НайтиПолучитьДокумент(Текст);  
		
		Если Д <> Ложь Тогда
			ПараметрыФормыОстатки = Новый Структура; 
			ПараметрыФормыОстатки.Вставить("Ссылка",Д);
			АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
			_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
			ОткрытьФорму("Обработка.СК_МобСклад.Форма.ФормаВП", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Иначе
			
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
			ПоказатьПредупреждение(Оповещение,"Документ не найден",10,"Внимание!!!");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(Значение, ДопПараметры) Экспорт
	ЗаполнитьТЧ();	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт
	ЭтаФорма.Элементы.СканQR.РедактированиеТекста = Истина;
	АктивироватьПоиск();
КонецПроцедуры


&НаСервере
Функция НайтиПолучитьДокумент(Текст)
	СЗ = Разложить(Текст,";");
	ДокСсылка = Ложь;
	
	Попытка
		ДокСсылка = Документы.ЗаказНаВнутреннееПотребление.ПолучитьСсылку(Новый УникальныйИдентификатор(СЗ[0])) ;  
	Исключение
		
	КонецПопытки;

	Попытка
		ДокСсылка = Документы.ЗаказНаСборку.ПолучитьСсылку(Новый УникальныйИдентификатор(СЗ[0])) ;  
	Исключение
		
	КонецПопытки;
		
	Возврат ДокСсылка;
КонецФункции


//////////////////////
Функция Разложить(Знач Стр, Разделитель = ";") Экспорт
	
	Список = Новый Массив();
	Длина = СтрДлина(Разделитель);
	
	Стр = СокрЛП(Стр);
	Поз = Найти(Стр, Разделитель);
	
	Пока 0 < Поз Цикл
		Список.Добавить(СокрП(Лев(Стр, Поз-1)));
		
		Стр = СокрЛ(Сред(Стр, Поз+Длина));
		Поз = Найти(Стр, Разделитель);
	КонецЦикла;
	
	Список.Добавить(Стр);
	
	Возврат Список;
	
КонецФункции


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьТЧ();
КонецПроцедуры

