
&Вместо("ОбработкаПроверкиЗаполнения")
Процедура СК_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) 
	
	//Добавлен проверяемый реквизит, что бы нельзя было провести сборку без заказа
	//+
	Если Склад = Справочники.Склады.НайтиПоНаименованию("Основной склад") Тогда
		ПроверяемыеРеквизиты.Добавить("ЗаказНаСборку");
		ПроверяемыеРеквизиты.Добавить("Подразделение");
	КонецЕсли;
	//-
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	ИспользоватьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	ХозяйственныеОперации = Перечисления.ХозяйственныеОперации;
	
	// Проверка количества в шапке.
	ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияКоличества();
	ПараметрыПроверки.ИмяТЧ = "Объект";
	НоменклатураСервер.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ, ПараметрыПроверки);

	// Проверка количества в т.ч. товары.
	НоменклатураСервер.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);

	// Если сборка - доля стоимости не нужна.
	Если ХозяйственнаяОперация = ХозяйственныеОперации.СборкаТоваров Или Товары.Количество() < 2 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ДоляСтоимости");
	КонецЕсли;

	// Если накладная по заказу - то код строки должен быть заполнен.
	Если Не ЗначениеЗаполнено(ЗаказНаСборку) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КодСтроки");
	КонецЕсли;

	// Проверка характеристки в шапке.
	Если Не ИспользоватьХарактеристики
		Или Не Справочники.Номенклатура.ХарактеристикиИспользуются(Номенклатура) Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("Характеристика");
	
	КонецЕсли;
	
	ЗапретитьПоступлениеТоваровБезНомеровГТД = ПолучитьФункциональнуюОпцию("ЗапретитьПоступлениеТоваровБезНомеровГТД");
	ИспользоватьУчетПрослеживаемыхИмпортныхТоваров =
		УчетПрослеживаемыхТоваровЛокализация.ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(Дата);
	
	ИменаРеквизитов = "ВестиУчетПоГТД, ПрослеживаемыйТовар";
	РеквизитыНоменклатуры = ОбщегоНазначенияУТ.ЗначенияРеквизитовОбъектаПоУмолчанию(Номенклатура, ИменаРеквизитов);
	
	ПрослеживаемыйКомплект = РеквизитыНоменклатуры.ПрослеживаемыйТовар
								И ИспользоватьУчетПрослеживаемыхИмпортныхТоваров;
	КонтролироватьНомераГТД = ЗапретитьПоступлениеТоваровБезНомеровГТД
								И ((РеквизитыНоменклатуры.ВестиУчетПоГТД
										И ХозяйственнаяОперация = ХозяйственныеОперации.СборкаТоваров)
									Или Не РеквизитыНоменклатуры.ВестиУчетПоГТД
										И ХозяйственнаяОперация = ХозяйственныеОперации.РазборкаТоваров);
	
	Если Не ПрослеживаемыйКомплект
		И ЗначениеЗаполнено(НоменклатураОсновногоКомпонента)
		И ХозяйственнаяОперация = ХозяйственныеОперации.СборкаТоваров Тогда
		
		ПредставлениеОсновногоКомпонента = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
											НоменклатураОсновногоКомпонента,
											ХарактеристикаОсновногоКомпонента);
		
		ОтборТоваров = Новый Структура("Номенклатура, Характеристика",
										НоменклатураОсновногоКомпонента, ХарактеристикаОсновногоКомпонента);
		
		Если Товары.НайтиСтроки(ОтборТоваров).Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Основной компонент `%НазваниеТовара%` в товарах не найден.
				|Укажите основной компонент из перечня товаров'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НазваниеТовара%", ПредставлениеОсновногоКомпонента);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Неопределено, "", "Объект", Отказ);
		КонецЕсли;
		
		Если КонтролироватьНомераГТД Тогда
			КомпонентВестиУчетПоГТД =
				ОбщегоНазначенияУТ.ЗначенияРеквизитовОбъектаПоУмолчанию(НоменклатураОсновногоКомпонента,"ВестиУчетПоГТД").ВестиУчетПоГТД;
			
			Если Не КомпонентВестиУчетПоГТД Тогда
				ТекстСообщения = НСтр("ru = 'По основному компоненту `%НазваниеТовара%` учет по ГТД не ведется.
					|Укажите основной компонент, по которому ведется учет по ГТД.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НазваниеТовара%", ПредставлениеОсновногоКомпонента);
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Неопределено, "", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		ПроверятьХарактеристикуКомпонента =
			ИспользоватьХарактеристики
			И Не ЗначениеЗаполнено(ХарактеристикаОсновногоКомпонента)
			И Справочники.Номенклатура.ХарактеристикиИспользуются(НоменклатураОсновногоКомпонента);
		
		Если ПроверятьХарактеристикуКомпонента Тогда
			ПроверяемыеРеквизиты.Добавить("ХарактеристикаОсновногоКомпонента");
		КонецЕсли;
		
	ИначеЕсли Не ПрослеживаемыйКомплект
		И КонтролироватьНомераГТД
		И ХозяйственнаяОперация = ХозяйственныеОперации.СборкаТоваров Тогда
		
		ТекстСообщения = НСтр("ru = 'Требуется определять страну происхождения и номера ГТД комплекта.
			|Укажите основной компонент, по которому ведется учет по ГТД.'");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Неопределено, "", "Объект", Отказ);
		
	ИначеЕсли ПрослеживаемыйКомплект
		И ХозяйственнаяОперация = ХозяйственныеОперации.СборкаТоваров Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Компоненты.НомерСтроки КАК НомерСтроки,
		|	Компоненты.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ Компоненты
		|ИЗ &Компоненты КАК Компоненты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Компоненты.НомерСтроки
		|ИЗ
		|	Компоненты КАК Компоненты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО СправочникНоменклатура.Ссылка = Компоненты.Номенклатура
		|
		|ГДЕ
		|	СправочникНоменклатура.ПрослеживаемыйТовар";
		
		Запрос.УстановитьПараметр("Компоненты", Товары.Выгрузить( , "НомерСтроки, Номенклатура"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ТекстСообщения = НСтр("ru = 'В списке ""Комплектующие"" отсутствуют прослеживаемые по РНПТ комплектующие.
			|Для сборки прослеживаемого комплекта необходимо указать хотя бы одну прослеживаемую комплектующую.'");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Неопределено, "", "Объект", Отказ);
		КонецЕсли;
		
	ИначеЕсли (КонтролироватьНомераГТД
			Или (Не ПрослеживаемыйКомплект
				И ИспользоватьУчетПрослеживаемыхИмпортныхТоваров))
		И ХозяйственнаяОперация = ХозяйственныеОперации.РазборкаТоваров Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Компоненты.НомерСтроки КАК НомерСтроки,
		|	Компоненты.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ Компоненты
		|ИЗ &Компоненты КАК Компоненты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Компоненты.НомерСтроки		КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА НЕ (НЕ &ПрослеживаемыйКомплект
		|				И СправочникНоменклатура.ПрослеживаемыйТовар
		|				И &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров)
		|			ТОГДА &КонтролироватьНомераГТД
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ						КАК ВестиУчетПоГТД,
		|	ВЫБОР
		|		КОГДА НЕ &ПрослеживаемыйКомплект
		|				И СправочникНоменклатура.ПрослеживаемыйТовар
		|				И &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ						КАК ПрослеживаемыйТовар
		|	
		|ИЗ
		|	Компоненты КАК Компоненты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО СправочникНоменклатура.Ссылка = Компоненты.Номенклатура
		|
		|ГДЕ
		|	СправочникНоменклатура.ВестиУчетПоГТД
		|	И (&КонтролироватьНомераГТД
		|		ИЛИ (НЕ &ПрослеживаемыйКомплект
		|			И СправочникНоменклатура.ПрослеживаемыйТовар
		|			И &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров))";
		
		Запрос.УстановитьПараметр("Компоненты", Товары.Выгрузить( , "НомерСтроки, Номенклатура"));
		Запрос.УстановитьПараметр("ПрослеживаемыйКомплект", ПрослеживаемыйКомплект);
		Запрос.УстановитьПараметр("КонтролироватьНомераГТД", КонтролироватьНомераГТД);
		Запрос.УстановитьПараметр("ИспользоватьУчетПрослеживаемыхИмпортныхТоваров",
									ИспользоватьУчетПрослеживаемыхИмпортныхТоваров);
		
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаПроверкиДанных = РезультатЗапроса.Выгрузить();
		ТаблицаПроверкиДанных.Индексы.Добавить("ВестиУчетПоГТД");
		ТаблицаПроверкиДанных.Индексы.Добавить("ПрослеживаемыйТовар");
		
		ОтборИмпортныхТоваров		= Новый Структура("ВестиУчетПоГТД", Истина);
		ОтборПрослеживаемыхТоваров	= Новый Структура("ПрослеживаемыйТовар", Истина);
		
		ИмпортныеТовары			= ТаблицаПроверкиДанных.НайтиСтроки(ОтборИмпортныхТоваров);
		ПрослеживаемыеТовары	= ТаблицаПроверкиДанных.НайтиСтроки(ОтборПрослеживаемыхТоваров);
		
		Если ИмпортныеТовары.Количество() > 0 Тогда
			ШаблонСообщения = НСтр("ru = 'Для комплектующей в строке %НомерСтроки% списка ""Комплектующие"" ведется учет по ГТД.
				|Такие позиции недопустимы, если для разбираемого комплекта не ведется учет по ГТД.'");
			
			Для Каждого СтрокаТЧ Из ИмпортныеТовары Цикл
				ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%НомерСтроки%", СтрокаТЧ.НомерСтроки);
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТЧ.НомерСтроки, "НомерГТД");
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Неопределено, Поле, "Объект", Отказ);
			КонецЦикла;
		КонецЕсли;
		
		Если ПрослеживаемыеТовары.Количество() > 0 Тогда
			ШаблонСообщения = НСтр("ru = 'В строке %НомерСтроки% списка ""Комплектующие"" указана прослеживаемая по РНПТ комплектующая.
				|Такие позиции недопустимы, если выполняется разборка непрослеживаемого комплекта.'");
			
			Для Каждого СтрокаТЧ Из ПрослеживаемыеТовары Цикл
				ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%НомерСтроки%", СтрокаТЧ.НомерСтроки);
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТЧ.НомерСтроки, "НомерГТД");
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Неопределено, Поле, "Объект", Отказ);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	// Проверка характеристик в т.ч. товары.
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	
	ОтборТоваров = Новый Структура("Номенклатура, Характеристика", Номенклатура, Характеристика);
	ПредставлениеКомплекта = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(Номенклатура, Характеристика);
	Для Каждого СтрокаТЧ Из Товары.НайтиСтроки(ОтборТоваров) Цикл
		ТекстСообщения = НСтр("ru = 'В строке %НомерСтроки% указан товар ""%НазваниеТовара%"".
			|Один и тот же товар не может являться и комплектом, и комплектующей одновременно.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НазваниеТовара%", ПредставлениеКомплекта);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", СтрокаТЧ.НомерСтроки);
	
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТЧ.НомерСтроки, "Номенклатура");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Неопределено, Поле, "Объект", Отказ);
	КонецЦикла;
	
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.СборкаТоваров);
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ПараметрыУказанияСерий.ТЧ);
	МассивПараметров.Добавить(ПараметрыУказанияСерий.Шапка);
	НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект,
		МассивПараметров,
		Отказ,
		МассивНепроверяемыхРеквизитов);
		
	ИсправлениеДокументов.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
		МассивНепроверяемыхРеквизитов.Добавить("ПодразделениеПроизводства");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	СборкаТоваровЛокализация.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
	ПараметрыПроверки = УчетНДСУП.ПараметрыПроверкиЗаполненияДокументаПоВидуДеятельностиНДС();
	ПараметрыПроверки.ИмяТабличнойЧасти = "Товары";
	УчетНДСУП.ПроверитьЗаполнениеДокументаПоВидуДеятельностиНДС(ЭтотОбъект, СборкаПодДеятельность, ПараметрыПроверки, Отказ);

КонецПроцедуры

&Перед("ОбработкаПроведения")
Процедура СК_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если РежимПроведения = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	СК_СписаниеСклад.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.СК_СписаниеСклад КАК СК_СписаниеСклад
		               |ГДЕ
		               |	СК_СписаниеСклад.ПометкаУдаления = &ПометкаУдаления
		               |	И СК_СписаниеСклад.Проведен = &Проведен
		               |	И СК_СписаниеСклад.ДокументОснования = &ДокументОснования";
		Запрос.УстановитьПараметр("ДокументОснования",ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Проведен",Истина);
		Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
		
		Рез = Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			Док = Рез.Ссылка.ПолучитьОбъект(); 
			Док.СобранныеТовары.Очистить();
			Док.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
