
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКНоменклатуры;
КонецПроцедуры

&НаКлиенте
Процедура ШКНоменклатурыИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПоискНоменклатурыШК(Текст);  
	Если ЭтаФорма.Номенклатура <> "" Тогда
		ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
		АктивироватьПоискШКЯчейки();
		//ПодключитьОбработчикОжидания("АктивироватьПоискШКЯчейки",5,Истина);
	КонецЕсли;
	
КонецПроцедуры 


&НаСервере
Процедура ПоискНоменклатурыШК(ШК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	Запрос.УстановитьПараметр("Штрихкод",ШК);
	Рез = Запрос.Выполнить().Выгрузить();

	/////////////////
		ШКНоменклатуры = "";
		ШКЯчейки = "";
		ШКЯчейкиПолучатель = "";
		ЭтаФорма.Ячейка = Справочники.СК_Ячейки.ПустаяСсылка();
		ЭтаФорма.ЯчейкаПолучатель = Справочники.СК_Ячейки.ПустаяСсылка();
/////////////////

	Если Рез.Количество()=1 Тогда
		ЭтаФорма.Номенклатура = Рез[0].Номенклатура;
		ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "";
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКЯчейки;
	Иначе 
		ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "Номенклатура не найдена";
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКНоменклатуры;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ШКЯчейкиИзменениеТекстаРедактированияНаСервере(ШК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_Ячейки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СК_Ячейки КАК СК_Ячейки
	               |ГДЕ
	               |	СК_Ячейки.ШтрихКод = &ШтрихКод";
	Запрос.УстановитьПараметр("ШтрихКод",ШК);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()=1 Тогда
		ЭтаФорма.Ячейка = Рез[0].Ссылка; 
		ПроверитьНайтиКоличество();
		//ЭтаФорма.Элементы.ОшибкаЯчейка.Заголовок = "";
	Иначе 
		ЭтаФорма.Элементы.ОшибкаЯчейка.Заголовок = "Ячейка не найдена";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНайтиКоличество()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
	               |	И СК_ТоварыНаСкладахОстатки.Ячейка = &Ячейка"; 
	Запрос.УстановитьПараметр("Номенклатура",ЭтаФорма.Номенклатура);
	Запрос.УстановитьПараметр("Ячейка",ЭтаФорма.Ячейка); 
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()=1 Тогда
		ЭтаФорма.Вналичии = Рез.Итог("ВналичииОстаток"); 
		ЭтаФорма.Элементы.Вналичии.Доступность = Истина;
		ЭтаФорма.Элементы.ГруппаПриемник.Доступность = Истина;
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКЯчейкиПолучатель;
		ЭтаФорма.Элементы.ОшибкаЯчейка.Заголовок = "";
	Иначе
		ЭтаФорма.Элементы.ГруппаПриемник.Доступность = Ложь;
		ЭтаФорма.Вналичии = 0 ; 
		ЭтаФорма.Элементы.Вналичии.Доступность = Ложь;
		ЭтаФорма.Элементы.ОшибкаЯчейка.Заголовок = "В ячейке нет товара";
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКЯчейки;

	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ШКЯчейкиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ШКЯчейкиИзменениеТекстаРедактированияНаСервере(Текст);
КонецПроцедуры


&НаСервере
Функция ПроверитьКоличество()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
	               |	И СК_ТоварыНаСкладахОстатки.Ячейка = &Ячейка"; 
	Запрос.УстановитьПараметр("Номенклатура",ЭтаФорма.Номенклатура);
	Запрос.УстановитьПараметр("Ячейка",ЭтаФорма.Ячейка); 
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()=1 Тогда
    	Возврат Рез.Итог("ВналичииОстаток");
	Иначе
		Возврат 0;	
	КонецЕсли;
	
КонецФункции


&НаСервере
Функция ПереместитьНаСервере()
	К = ПроверитьКоличество();
	Если ЭтаФорма.Номенклатура.Ссылка.Пустая() =  Ложь И 
		ЭтаФорма.Ячейка.Ссылка.Пустая() = Ложь И 
		ЭтаФорма.ЯчейкаПолучатель.Ссылка.Пустая() = Ложь И 
		ЭтаФорма.Вналичии <=К Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	СК_Перемещение.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СК_Перемещение КАК СК_Перемещение
		|ГДЕ
		|	СК_Перемещение.ПометкаУдаления = &ПометкаУдаления
		|	И СК_Перемещение.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СК_Перемещение.Проведен = &Проведен"; 
		Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);  
		Запрос.УстановитьПараметр("Проведен", Истина);
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата())); 
		
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Следующий() Тогда
			ТекДок = Рез.Ссылка.ПолучитьОбъект();
		Иначе
			ТекДок = Документы.СК_Перемещение.СоздатьДокумент(); 
			ТекДок.Дата =ТекущаяДата(); 
		КонецЕсли;
		НоваяСтрока = ТекДок.Товары.Добавить();
		НоваяСтрока.Номенклатура = ЭтаФорма.Номенклатура;

		НоваяСтрока.Количество = ЭтаФорма.Вналичии;
		НоваяСтрока.Время = ТекущаяДата(); 
		НоваяСтрока.ЯчейкаОтправитель = ЭтаФорма.Ячейка;;
		НоваяСтрока.ЯчейкаПриемник = ЭтаФорма.ЯчейкаПолучатель;;
		
		Попытка
			ТекДок.Записать(РежимЗаписиДокумента.Проведение); 
			Возврат Истина;
		Исключение
			Возврат Ложь;
		Конецпопытки;	
		  
		
	Иначе 
		ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "Проверьте все поля и количество";
		Возврат Ложь;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура Переместить(Команда)
	О = ПереместитьНаСервере();
	Если О = Истина Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ШКЯчейкиПолучательИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ШКЯчейкиПолучательИзменениеТекстаРедактированияНаСервере(Текст);
КонецПроцедуры  

&НаСервере
Процедура ШКЯчейкиПолучательИзменениеТекстаРедактированияНаСервере(ШК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_Ячейки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СК_Ячейки КАК СК_Ячейки
	               |ГДЕ
	               |	СК_Ячейки.ШтрихКод = &ШтрихКод";
	Запрос.УстановитьПараметр("ШтрихКод",ШК);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()=1 Тогда
		ЭтаФорма.ЯчейкаПолучатель = Рез[0].Ссылка; 
		ЭтаФорма.Элементы.ОшибкаЯчейка1.Заголовок = ""; 
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Вналичии;
	Иначе 
		ЭтаФорма.ЯчейкаПолучатель = Справочники.СК_Ячейки.ПустаяСсылка();
		ЭтаФорма.Элементы.ОшибкаЯчейка1.Заголовок = "Ячейка не найдена";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ШКНоменклатуры.РедактированиеТекста = Истина;
	АктивироватьПоиск();
	//ПодключитьОбработчикОжидания("АктивироватьПоиск",5,Истина);

КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.ШКНоменклатуры.ОбновитьТекстРедактирования();
	Элементы.ШКНоменклатуры.Видимость = Ложь;
	Элементы.ШКНоменклатуры.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКНоменклатуры; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ШКНоменклатуры = "";
КонецПроцедуры  

/////

&НаКлиенте
Процедура АктивироватьПоискШКЯчейки() 
	ОчиститьШКСерверШКЯчейки(); 
	Элементы.ШКЯчейки.ОбновитьТекстРедактирования();
	Элементы.ШКЯчейки.Видимость = Ложь;
	Элементы.ШКЯчейки.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКЯчейки; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСерверШКЯчейки()
	ШКЯчейки = "";
КонецПроцедуры  


