Функция ОстатокПоЯчейкам(Номенклатура)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
	               |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура"; 
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);    
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции  


Функция ИзменитьКоличествономенклатураЯчейка(НовоеЧисло,Ячейка,Номенклатура) Экспорт
	ИстЧисло = Обработки.СК_МобСклад.ПолучитьОстатокНоменклатураЯчейка(Номенклатура,Ячейка);
	
	Разница = Число(НовоеЧисло) - ИстЧисло[0].ВналичииОстаток;
	
	
	Если Разница > 0 Тогда  
		ВидДвижения = Перечисления.ВидыДвиженияНакопления.Приход;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		               |	СК_Корректировка.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.СК_Корректировка КАК СК_Корректировка
		               |ГДЕ
		               |	СК_Корректировка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И СК_Корректировка.ВидДвижения = &ВидДвижения
		               |	И СК_Корректировка.Проведен = &Проведен
		               |	И СК_Корректировка.ПометкаУдаления = &ПометкаУдаления"; 
			Запрос.УстановитьПараметр("ВидДвижения",Перечисления.ВидыДвиженияНакопления.Приход);

	Иначе
		ВидДвижения = Перечисления.ВидыДвиженияНакопления.Расход;

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		               |	СК_Корректировка.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.СК_Корректировка КАК СК_Корректировка
		               |ГДЕ
		               |	СК_Корректировка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И СК_Корректировка.ВидДвижения = &ВидДвижения
		               |	И СК_Корректировка.Проведен = &Проведен
		               |	И СК_Корректировка.ПометкаУдаления = &ПометкаУдаления"; 
		Запрос.УстановитьПараметр("ВидДвижения",Перечисления.ВидыДвиженияНакопления.Расход); 
		Разница = Разница * (-1);
	КонецЕсли;	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Проведен",Истина);
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Док = Рез.Ссылка.ПолучитьОбъект();
	Иначе
		Док = Документы.СК_Корректировка.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
		Док.ВидДвижения = ВидДвижения;
	КонецЕсли;                        
	
	Т = Док.Товары.Добавить();
	Т.Номенклатура = Номенклатура;
	Т.Количество = Разница;
	Т.Время = ТекущаяДата();
	Т.Ячейка = Ячейка;
	Т.ВидДвижения = ВидДвижения;
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции
