




&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	ЭтотОбъект.ДокументПересчета = СтруктураПараметров.ДокументПересчета;	
	ЭтотОбъект.Секция = СтруктураПараметров.Секция;
	ЭтотОбъект.Номенклатура = СтруктураПараметров.Номенклатура;
	ЭтотОбъект.Ячейка = СтруктураПараметров.Ячейка;
	ЗаполнитьФорму();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму()
	Элементы.Отсканировано.Заголовок = "";
	// Проверка на заполненность реквизитов
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) 
		ИЛИ Не ЗначениеЗаполнено(ДокументПересчета.Ссылка) 
		ИЛИ Не ЗначениеЗаполнено(ЭтотОбъект.Секция) Тогда
		// Обработка случая, когда реквизиты не заполнены
		// Например, вывод сообщения или возврат из процедуры
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_Инвентаризация.Номенклатура КАК Номенклатура,
	               |	СК_Инвентаризация.Ячейка КАК Ячейка,
	               |	СК_Инвентаризация.Количество КАК Количество
	               |ИЗ
	               |	РегистрСведений.СК_Инвентаризация КАК СК_Инвентаризация
	               |ГДЕ
	               |	СК_Инвентаризация.Номенклатура = &Номенклатура
	               |	И СК_Инвентаризация.ДокументПересчета = &ДокументПересчета
	               |	И СК_Инвентаризация.Ячейка.Секция = &Секция"; 
	
	Запрос.УстановитьПараметр("Номенклатура", ЭтотОбъект.Номенклатура);
	Запрос.УстановитьПараметр("ДокументПересчета", ДокументПересчета.Ссылка);
	Запрос.УстановитьПараметр("Секция", ЭтотОбъект.Секция);

	Попытка
		Рез = Запрос.Выполнить().Выгрузить();
	Исключение
		// Обработка исключения, например, вывод сообщения об ошибке
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	Если Рез.Количество() = 1  Тогда
		КоличествоОтсканировано = Рез.Итог("Количество");
		Если ЭтотОбъект.Ячейка = Рез[0].Ячейка Тогда
			Элементы.Отсканировано.Заголовок = "Отсканировано: " + Строка(КоличествоОтсканировано) + " шт";
			Элементы.Изменить.Видимость = Истина;
			Элементы.Закрыть.Видимость = Истина;
			Элементы.Добавить.Видимость = Ложь;
		Иначе
			Элементы.Отсканировано.Заголовок = "Отсканировано по секции: " + Строка(КоличествоОтсканировано) + " шт";
		КонецЕсли;

	ИначеЕсли Рез.Количество() > 1  Тогда
		Для каждого СтрокаТЧ Из Рез Цикл
			Если ЭтотОбъект.Ячейка = СтрокаТЧ.Ячейка Тогда 
				Элементы.Отсканировано.Заголовок = "Отсканировано: " + Строка(СтрокаТЧ.Количество) + " шт";
				Элементы.Изменить.Видимость = Истина;
				Элементы.Закрыть.Видимость = Истина;
				Элементы.Добавить.Видимость = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Элементы.Отсканировано.Заголовок = "Отсканировано: 0 шт";
		Элементы.Изменить.Видимость = Ложь;
		Элементы.Закрыть.Видимость = Ложь;
		Элементы.Добавить.Видимость = Истина;		
	КонецЕсли;

	ЭтотОбъект.НаименованиеНоменклатуры = ЭтотОбъект.Номенклатура;

КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
	АктивироватьПоискЯчейки();

КонецПроцедуры    

&НаКлиенте
Процедура АктивироватьПоискЯчейки() 
	ОчиститьШКСервер(); 
	Элементы.ШКЯчейки.ОбновитьТекстРедактирования();
	Элементы.ШКЯчейки.Видимость = Ложь;
	Элементы.ШКЯчейки.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКЯчейки; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ШКЯчейки = "";
	СканШК = "";
	Количество = 0;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеБуфер(Параметры) Экспорт  
			ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
			АктивироватьПоискЯчейки();
КонецПроцедуры


&НаКлиенте
Процедура ШКЯчейкиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если Текст = "0000000000001" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеБуфер", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Буфер не сканировать!!! ",5,"Ошибка");
		
	Иначе	
		
		Если ШКЯчейкиИзменениеТекстаРедактированияНаСервере(Текст) = Истина Тогда
			АктивироватьПоискСканШК();
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеБуфер", ЭтотОбъект);
			ПоказатьПредупреждение(Оповещение,"Отсканируйте правильную ячейку ",5,"Ошибка");
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура АктивироватьПоискСканШК() 
	ОчиститьШКСервер(); 
	Элементы.СканШК.ОбновитьТекстРедактирования();
	Элементы.СканШК.Видимость = Ложь;
	Элементы.СканШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 


&НаСервере
Функция ШКЯчейкиИзменениеТекстаРедактированияНаСервере(ШК)

	
	ЯчейкаПоиск = Справочники.СК_Ячейки.НайтиПоРеквизиту("ШтрихКод",СокрЛП(ШК)).Ссылка;
	
	Если ЯчейкаПоиск.Секция = Секция Тогда 
		
		ЭтотОбъект.Ячейка = ЯчейкаПоиск;
		Возврат Истина;	
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СканШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	//СК = СканШКИзменениеТекстаРедактированияНаСервере(Текст);
	
	Если СканШКИзменениеТекстаРедактированияНаСервере(Текст) = Ложь Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеБуфер", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Номенклатура не найдена ",5,"Ошибка");
	Иначе
		ЗаполнитьФорму();
	КонецЕсли;

КонецПроцедуры    

&НаКлиенте
Процедура АктивироватьКОличество() 
	ОчиститьШКСервер(); 
	Элементы.Количество.ОбновитьТекстРедактирования();
	Элементы.Количество.Видимость = Ложь;
	Элементы.Количество.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Количество; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 


&НаСервере
Функция СканШКИзменениеТекстаРедактированияНаСервере(Шк)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод",Шк);
 
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		ЭтотОбъект.Номенклатура = Рез.Номенклатура.Ссылка;
 		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции

&НаСервере
Процедура ДобавитьНаСервере()
	ЭтотОбъект.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	ЭтотОбъект.НаименованиеНоменклатуры = "";
	ЭтотОбъект.Ячейка  = Справочники.СК_Ячейки.ПустаяСсылка();
	ЭтотОбъект.Количество = 0;
	ЗаполнитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	КоличествоПриИзмененииНаСервере();
	ДобавитьНаСервере();
	ЗаполнитьФорму();
	ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
	АктивироватьПоискЯчейки();
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)

	ИзменитьКоличествоСканирования();
	ЗаполнитьФорму();
	ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
	АктивироватьПоискЯчейки();
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеБуфер", ЭтотОбъект);
	ПоказатьПредупреждение(Оповещение,"Количество изменено ",5,"");

КонецПроцедуры
//////
&НаСервере
Процедура ИзменитьКоличествоСканирования() 
	
	ТекПользователь = Пользователи.АвторизованныйПользователь().Ссылка; 
	
	НаборЗаписей = РегистрыСведений.СК_Инвентаризация.СоздатьНаборЗаписей();  			
	НаборЗаписей.Отбор.Номенклатура.Установить(ЭтотОбъект.Номенклатура);
	НаборЗаписей.Отбор.Ячейка.Установить(ЭтотОбъект.Ячейка);
	НаборЗаписей.Отбор.Пользователь.Установить(ТекПользователь);
	НаборЗаписей.Отбор.ДокументПересчета.Установить(ДокументПересчета);

	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 1 Тогда
		НЗапись = НаборЗаписей[0];
		НЗапись.Количество = ЭтаФорма.Количество;
	КонецЕсли;
	НаборЗаписей.Записать();
	// Вставить содержимое обработчика.
КонецПроцедуры
////////////
&НаСервере
Процедура КоличествоПриИзмененииНаСервере() 
	
	ТекПользователь = Пользователи.АвторизованныйПользователь().Ссылка; 
	
	НаборЗаписей = РегистрыСведений.СК_Инвентаризация.СоздатьНаборЗаписей();  			
	НаборЗаписей.Отбор.Номенклатура.Установить(ЭтотОбъект.Номенклатура);
	НаборЗаписей.Отбор.Ячейка.Установить(ЭтотОбъект.Ячейка);
	НаборЗаписей.Отбор.Пользователь.Установить(ТекПользователь);
	НаборЗаписей.Отбор.ДокументПересчета.Установить(ДокументПересчета);

	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		НЗапись = НаборЗаписей.Добавить();
		НЗапись.Номенклатура = ЭтотОбъект.Номенклатура;
		НЗапись.Ячейка = ЭтотОбъект.Ячейка;
		НЗапись.Количество = ЭтаФорма.Количество;
		НЗапись.Пользователь = ТекПользователь;
		НЗапись.ДокументПересчета = ЭтотОбъект.ДокументПересчета;
	ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
		НЗапись = НаборЗаписей[0];
		НЗапись.Количество = НЗапись.Количество + ЭтаФорма.Количество;
	КонецЕсли;
	НаборЗаписей.Записать();
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	//КоличествоПриИзмененииНаСервере(); 
	//ЗаполнитьФорму();
КонецПроцедуры



