
&НаКлиенте
Процедура СК_ТоварыСодержаниеНачалоВыбораПосле(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Элементы.Товары.ТекущиеДанные.Содержание",
		НСтр("ru='Содержание услуги'"));

КонецПроцедуры

&НаКлиенте
Процедура СК_ОтгрузкаПоТСДПосле(Команда)
		ПараметрыФормыЗаказа = Новый Структура;
		ПараметрыФормыЗаказа.Вставить("Ссылка",Объект.Ссылка);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыЗаказа,Новый УникальныйИдентификатор);
		СтруктураПараметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСборкаПоТСД", ЭтотОбъект);
		ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.СК_ФормаТСД", СтруктураПараметры,ЭтотОбъект, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры 
	
	
&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСборкаПоТСД(Значение, ДопПараметры) Экспорт 
	 
	ОбработатьЗакрытиеФормыСборкаПоТСДНаСервере(Значение.ДокСборки);
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьЗакрытиеФормыСборкаПоТСДНаСервере(ДокСборки)  
	
	Если ДокСборки.Пустая() = Ложь Тогда
		Док = ДокСборки.ПолучитьОбъект();
		Если Док.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран Тогда
			Объект.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран ; 
		Иначе
			Объект.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран ;

		КонецЕсли;
		
		Если Док.Товары.Количество() <> Объект.Товары.Количество() Тогда
			ТабТовары = Док.Товары.Выгрузить();
			
			Для Каждого стр из Объект.Товары Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("Номенклатура",стр.Номенклатура);
				Строки = ТабТовары.НайтиСтроки(Отбор);
				Если Строки.Количество() = 0 Тогда
					Объект.Товары.Удалить(стр);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура СК_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
Если Объект.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран Тогда 
			ЭтаФорма.ДокументСборки = ПолучитьДокументСборки();
			ЭтаФорма.Элементы.Товары.ИзменятьПорядокСтрок = Ложь;
			ЭтаФорма.Элементы.Товары.ИзменятьСоставСтрок = Ложь;
			ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыНоменклатура.ТолькоПросмотр = Истина;
			ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыКоличествоУпаковок.ТолькоПросмотр = Истина;
		КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда

      Объект.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран;

    КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьДокументСборки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СК_СписаниеСклад.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СК_СписаниеСклад КАК СК_СписаниеСклад
	               |ГДЕ
	               |	СК_СписаниеСклад.ДокументОснования = &ДокументОснования
	               |	И СК_СписаниеСклад.СтатусСборки = ЗНАЧЕНИЕ(Перечисление.СК_СтатусСборкиРеализации.Собран)
	               |	И СК_СписаниеСклад.Проведен = &Проведен
	               |	И СК_СписаниеСклад.ПометкаУдаления = &ПометкаУдаления";   
	
	Запрос.УстановитьПараметр("ДокументОснования",Объект.Ссылка);
	Запрос.УстановитьПараметр("Проведен",Истина);
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	КонецЕсли;
	
	
КонецФункции
