&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
	АктивироватьПоиск();

КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.ШКЯчейки.ОбновитьТекстРедактирования();
	Элементы.ШКЯчейки.Видимость = Ложь;
	Элементы.ШКЯчейки.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКЯчейки; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ШКЯчейки = "";  
	ШКТовара = "";	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКЯчейки;
КонецПроцедуры

&НаСервере
Процедура ШКИзменениеТекстаРедактированияНаСервере(ШК)
	ЭтаФорма.Ячейка = Справочники.СК_Ячейки.НайтиПоРеквизиту("ШтрихКод",СокрЛП(ШК)); 
	ЭтаФорма.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура ШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ШКИзменениеТекстаРедактированияНаСервере(Текст); 
	
	Если ЭтаФорма.Ячейка <> "" Тогда
		ЭтаФорма.Элементы.ШКТовара.РедактированиеТекста = Истина;
		АктивироватьПоискШКТовара();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоискШКТовара() 
	ОчиститьШКСервер(); 
	Элементы.ШКТовара.ОбновитьТекстРедактирования();
	Элементы.ШКТовара.Видимость = Ложь;
	Элементы.ШКТовара.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКТовара; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 


&НаКлиенте
Процедура Сохранить(Команда) 
	СохранитьНаСервере();
	Если ЭтаФорма.Контроль = Истина Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Сохранено",5,"Внимание!!!");
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Произошла ошибка",5,"Внимание!!!");
	КонецЕсли;		
КонецПроцедуры 

&НаСервере
Процедура СохранитьНаСервере()
	Разница = ЭтаФорма.Количество - ЭтаФорма.Элементы.ТекКоличество.Заголовок;
	
	
	Если Разница > 0 Тогда  
		ВидДвижения = Перечисления.ВидыДвиженияНакопления.Приход;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		               |	СК_Корректировка.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.СК_Корректировка КАК СК_Корректировка
		               |ГДЕ
		               |	СК_Корректировка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И СК_Корректировка.ВидДвижения = &ВидДвижения
		               |	И СК_Корректировка.Проведен = &Проведен
		               |	И СК_Корректировка.ПометкаУдаления = &ПометкаУдаления"; 
			Запрос.УстановитьПараметр("ВидДвижения",Перечисления.ВидыДвиженияНакопления.Приход);

	Иначе
		ВидДвижения = Перечисления.ВидыДвиженияНакопления.Расход;

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		               |	СК_Корректировка.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.СК_Корректировка КАК СК_Корректировка
		               |ГДЕ
		               |	СК_Корректировка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И СК_Корректировка.ВидДвижения = &ВидДвижения
		               |	И СК_Корректировка.Проведен = &Проведен
		               |	И СК_Корректировка.ПометкаУдаления = &ПометкаУдаления"; 
		Запрос.УстановитьПараметр("ВидДвижения",Перечисления.ВидыДвиженияНакопления.Расход); 
		Разница = Разница * (-1);
	КонецЕсли;	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Проведен",Истина);
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Док = Рез.Ссылка.ПолучитьОбъект();
	Иначе
		Док = Документы.СК_Корректировка.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
		Док.ВидДвижения = ВидДвижения;
	КонецЕсли;                        
	
	Т = Док.Товары.Добавить();
	Т.Номенклатура = ЭтаФорма.Номенклатура;
	Т.Количество = Разница;
	Т.Время = ТекущаяДата();
	Т.Ячейка = ЭтаФорма.Ячейка;
	Т.ВидДвижения = ВидДвижения;
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		ЭтаФорма.Контроль = Истина;
	Исключение
		ЭтаФорма.Контроль = Ложь;
	КонецПопытки;

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Параметры) Экспорт
	ЭтаФорма.Закрыть();
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт
	
	
КонецПроцедуры

&НаКлиенте
Процедура ШКТовараИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ШКТовараИзменениеТекстаРедактированияНаСервере(Текст);  
	Если ЭтаФорма.Элементы.ТекКоличество.Заголовок = "" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"В ячейке нет товара !!!",5,"Внимание!!!");
	Иначе
		ЭтаФорма.Элементы.Количество.РедактированиеТекста = Истина;
		АктивироватьКоличество();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьКоличество() 
	ОчиститьШКСервер(); 
	Элементы.Количество.ОбновитьТекстРедактирования();
	Элементы.Количество.Видимость = Ложь;
	Элементы.Количество.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Количество; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 


&НаСервере
Процедура ШКТовараИзменениеТекстаРедактированияНаСервере(ШК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |		ПО СК_ТоварыНаСкладахОстатки.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	               |ГДЕ
	               |	СК_ТоварыНаСкладахОстатки.Ячейка = &Ячейка
	               |	И ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
		Запрос.УстановитьПараметр("Ячейка",ЭтаФорма.Ячейка);
		Запрос.УстановитьПараметр("Штрихкод",ШК);
		Рез = Запрос.Выполнить().Выгрузить();
		
		ЭтаФорма.Элементы.ТекКоличество.Заголовок = "";
		
		Если Рез.Количество()>=1 Тогда 
			ЭтаФорма.Номенклатура = Рез[0].Номенклатура;
			ЭтаФорма.Элементы.ТекКоличество.Заголовок = Рез[0].ВналичииОстаток; 
		Иначе

		КонецЕсли;

КонецПроцедуры


