&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ШК.РедактированиеТекста = Истина;
	АктивироватьПоиск();

КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.ШК.ОбновитьТекстРедактирования();
	Элементы.ШК.Видимость = Ложь;
	Элементы.ШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ШК = "";
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШК;
КонецПроцедуры

&НаСервере
Процедура ШКИзменениеТекстаРедактированияНаСервере(ШК)
	Ячейка = Справочники.СК_Ячейки.НайтиПоРеквизиту("ШтрихКод",СокрЛП(ШК));
	Если Ячейка.Пустая() Тогда 
		Элементы.Ошибка.Заголовок = "Ячейка не найдена";
	Иначе 
		Элементы.Ошибка.Заголовок = Ячейка;
		ЭтаФорма.Элементы.Очистить.Видимость = Истина;
	КонецЕсли;
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ШКИзменениеТекстаРедактированияНаСервере(Текст);
КонецПроцедуры

&НаСервере
Функция ОчиститьНаСервере()
	Ош = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
|	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК Количество,
|	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
|	&Время КАК Время,
|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Расход) КАК ВидДвижения

|ИЗ
|	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
|ГДЕ
|	СК_ТоварыНаСкладахОстатки.Ячейка = &Ячейка";
	
	Запрос.УстановитьПараметр("Ячейка",Ячейка);
	Запрос.УстановитьПараметр("Время",ТекущаяДата());
	
	Рез = Запрос.Выполнить().Выгрузить();  
	Если Рез.Количество()>=1 Тогда
		Док = Документы.СК_Корректировка.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
		Док.Товары.Загрузить(Рез);
		
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Док.Записать(РежимЗаписиДокумента.Запись);
			Ош = Ложь;
		КонецПопытки;
	Иначе
		Ош = Ложь;
	КонецЕсли;
	
	Возврат Ош;
КонецФункции

&НаКлиенте
Процедура Очистить(Команда)
		Если ОчиститьНаСервере() Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
			ПоказатьПредупреждение(Оповещение,"Ячейка очищена",5,"");
			
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
			ПоказатьПредупреждение(Оповещение,"Произошла ошибка или буфер пустой",5,"");
		КонецЕсли;
	КонецПроцедуры  
	
	&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт
	ЭтаФорма.Закрыть();
КонецПроцедуры
