
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоИнвентаризацииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_Инвентаризация.Количество КАК Количество,
	               |	СК_Инвентаризация.Номенклатура КАК Номенклатура,
	               |	СК_Инвентаризация.Ячейка КАК Ячейка,
	               |	ВложенныйЗапрос.ВналичииОстаток КАК ВналичииОстаток
	               |ИЗ
	               |	РегистрСведений.СК_Инвентаризация КАК СК_Инвентаризация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |			СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
	               |			СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	               |		ИЗ
	               |			РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки) КАК ВложенныйЗапрос
	               |		ПО СК_Инвентаризация.Номенклатура = ВложенныйЗапрос.Номенклатура
	               |			И СК_Инвентаризация.Ячейка = ВложенныйЗапрос.Ячейка";
	Рез = Запрос.Выполнить().Выгрузить();
	Для Каждого стр из Рез Цикл
		Если стр.ВналичииОстаток = Null Тогда
			Т = Объект.Товары.Добавить();
			Т.Номенклатура = стр.Номенклатура;
			Т.Количество = стр.Количество;
			Т.Ячейка = стр.Ячейка;
			Т.ВидДвижения = Перечисления.ВидыДвиженияНакопления.Приход;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИнвентаризации(Команда)
	ЗаполнитьПоИнвентаризацииНаСервере();
КонецПроцедуры


