
Процедура ОбработкаПроведения(Отказ, Режим) 
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СК_ТоварыНаСкладах Расход
	Движения.СК_ТоварыНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаСобранныеТовары Из СобранныеТовары Цикл
		Движение = Движения.СК_ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ТекСтрокаСобранныеТовары.ВремяНабора;
		Движение.Номенклатура = ТекСтрокаСобранныеТовары.Номенклатура;
		Движение.Ячейка = ТекСтрокаСобранныеТовары.Ячейка;
		Движение.Вналичии = ТекСтрокаСобранныеТовары.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран;
	ДокОсн = ДокументОснования.Ссылка.ПолучитьОбъект();
	ДокОсн.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран;
	ДокОсн.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Таб = СобранныеТовары.Выгрузить();
	Таб.Свернуть("Номенклатура","Количество");
	
	Для Каждого стр из Таб Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",стр.Номенклатура);
		
		Строки = Товары.НайтиСтроки(Отбор);
		
		Если Строки.Количество() = 1 Тогда
			Если Строки[0].КоличествоУпаковок = стр.Количество Тогда
				Строки[0].Собран = Истина;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
	
	ТаблицаТоваров = Товары.Выгрузить();
	ТаблицаТоваров.Свернуть("Номенклатура");
	
	ПоискТоваров = Обработки.СК_МобСклад.ПолучитьОстаток(ТаблицаТоваров);
	
	Если ПоискТоваров.Количество()>=1 Тогда
		Для Каждого стр из Товары Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",стр.Номенклатура);
			Строки =  ПоискТоваров.НайтиСтроки(Отбор);
			Если Строки.Количество()= 0 Тогда 
				стр.Собран = Истина;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого стр из Товары Цикл
			стр.Собран = Истина;
		КонецЦикла;  
		СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран;
	КонецЕсли; 
	

	Отбор = Новый Структура;
	Отбор.Вставить("Собран",Ложь);
	
	ПСтроки = Товары.НайтиСтроки(Отбор);
	
	Если ПСтроки.Количество() = 0 Тогда 
		СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран; 
		
		ДокОсн = ДокументОснования.Ссылка.ПолучитьОбъект();
		ДокОсн.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран;
		ДокОсн.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЕсли;
	

	
КонецПроцедуры
