Функция ПодключитьсяКбазе() экспорт
	ПараметрыПодключенияИБ = "Srvr=""SXT01""; Ref=""SXT_BUH""; Usr=""Саморукова Наталья""; Pwd=""123SAM""";;
	V83COMCon= Новый COMОбъект("V83.COMConnector");
	Попытка
	         Возврат V83COMCon.Connect(ПараметрыПодключенияИБ);
	Исключение
	         Сообщить(ОписаниеОшибки());
	         Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция ЦеныТребованияНакладные(УИД) Экспорт 
	Таб = Новый ТаблицаЗначений;
	Таб.Колонки.Добавить("НоменклатурныйНомер");
	Таб.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));		
	
	Соединение = ПодключитьсяКбазе();
	Если ТипЗнч(Соединение) <> Тип("Неопределено") Тогда 
		ТабCom = Соединение.БухгалтерскийУчетПереопределяемый.СХ_ПолучитьСуммуСписанияАктивовПоПартиям(Строка(УИД));
		Таб.Очистить();
		Для Каждого стр из ТабCom Цикл
			Т = Таб.Добавить();
			Т.НоменклатурныйНомер = стр.Номенклатура;
			Т.Сумма = стр.Сумма;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Таб;
КонецФункции
