&НаСервере
Процедура СК_УстановитьОтбор()
	
	ТабНоменклатуры = ТабНоменклатуры();
	
	СЗ_ДляОтбора = Новый СписокЗначений;

	СЗ_ДляОтбора.ЗагрузитьЗначения(ТабНоменклатуры.ВыгрузитьКолонку("Номенклатура")); // или испльзовать свой массив данных
	

	НовыйОтбор = ОтборПересчета.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
	НовыйОтбор.ПравоеЗначение = СЗ_ДляОтбора; 
	НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	НовыйОтбор.Использование = Истина;

КонецПроцедуры


&НаСервере
Процедура СК_ЗаполнитьСервер()
	УстановитьЗначениеПараметраНастроек(ОтборПересчета.Настройки, "ДатаОстатков", ?(ЗначениеЗаполнено(Объект.Дата),
		Новый Граница(Объект.Дата, ВидГраницы.Включая),
		Новый Граница(ТекущаяДатаСеанса(), ВидГраницы.Включая)));
	
	
	Если ИспользоватьАдресноеХранение Тогда
		СхемаКомпоновкиДанных = Документы.ПересчетТоваров.ПолучитьМакет("ОтборПересчетаПоЯчейкам");
	Иначе	
		СхемаКомпоновкиДанных = Документы.ПересчетТоваров.ПолучитьМакет("ОтборПересчетаПоСкладу");
	КонецЕсли;
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.ЗаполнениеПоОтборам.Запрос;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ТоварыВЯчейках.Упаковка", Неопределено));
	СхемаКомпоновкиДанных.НаборыДанных.ЗаполнениеПоОтборам.Запрос = ТекстЗапроса;

	СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(ОтборПересчета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборПересчета.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Объект.Товары.Загрузить(ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных));
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	ЗаполнитьПризнакРасхождение();
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
КонецПроцедуры

&НаКлиенте
Процедура СК_ЗагрузитьИзТСДВместо(Команда)
	Если Не СкладПомещениеЗаполнены() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Товары.Количество() > 0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершениеТСД", ЭтотОбъект), НСтр("ru = 'Перед заполнением список товаров будет очищен. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	ЗаполнитьФрагментТСД();
	
	СК_ЗагрузитьИзТСДВместоНаСервере();
КонецПроцедуры

 &НаКлиенте
Процедура ЗаполнитьЗавершениеТСД(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        Объект.Товары.Очистить();
    Иначе
        Возврат;
    КонецЕсли;
    
    ЗаполнитьФрагментТСД();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФрагментТСД()
 
    СК_УстановитьОтбор();
    
    СК_ЗаполнитьСервер();
    Объект.УчетныеДанныеЗаполнены = Ложь;

КонецПроцедуры
 
 &НаСервере
Функция ТабНоменклатуры()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СК_Инвентаризация.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.СК_БлокировкаСекций КАК СК_БлокировкаСекций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СК_Инвентаризация КАК СК_Инвентаризация
	|		ПО СК_БлокировкаСекций.Секция = СК_Инвентаризация.Ячейка.Секция
	|		И СК_БлокировкаСекций.ДокументПересчета = СК_Инвентаризация.ДокументПересчета
	|ГДЕ
	|	СК_БлокировкаСекций.Блокировка = ЗНАЧЕНИЕ(Перечисление.СК_СтатусыБлокировокСекций.Завершено)
	|	И СК_БлокировкаСекций.ДокументПересчета = &ДокументПересчета
	|СГРУППИРОВАТЬ ПО
	|	СК_Инвентаризация.Номенклатура
	|";
	Запрос.УстановитьПараметр("ДокументПересчета",Объект.Ссылка);
	Возврат Запрос.Выполнить().Выгрузить(); 
 КонецФункции

&НаСервере
Процедура СК_ЗагрузитьИзТСДВместоНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СК_Инвентаризация.Номенклатура КАК Номенклатура,
	|	СУММА(СК_Инвентаризация.Количество) КАК Количество,
	|   СК_БлокировкаСекций.Секция КАК Секция
	|ИЗ
	|	РегистрСведений.СК_БлокировкаСекций КАК СК_БлокировкаСекций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СК_Инвентаризация КАК СК_Инвентаризация
	|		ПО СК_БлокировкаСекций.Секция = СК_Инвентаризация.Ячейка.Секция
	|		И СК_БлокировкаСекций.ДокументПересчета = СК_Инвентаризация.ДокументПересчета
	|ГДЕ
	|	СК_БлокировкаСекций.Блокировка = ЗНАЧЕНИЕ(Перечисление.СК_СтатусыБлокировокСекций.Завершено)
	|	И СК_БлокировкаСекций.ДокументПересчета = &ДокументПересчета
	|СГРУППИРОВАТЬ ПО
	|	СК_Инвентаризация.Номенклатура,
	|	СК_БлокировкаСекций.Секция
	|";
	Запрос.УстановитьПараметр("ДокументПересчета",Объект.Ссылка);
	Рез = Запрос.Выполнить().Выгрузить(); 
	ТабТовары = Объект.Товары.Выгрузить();
	
	Для Каждого стр из Рез Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",стр.Номенклатура);
		Строки = ТабТовары.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда
			Строки[0].КоличествоФакт = стр.Количество; 
			Строки[0].КоличествоУпаковокФакт = стр.Количество; 
			Строки[0].КоличествоУпаковокОтклонение =  стр.Количество-Строки[0].КоличествоУпаковок;
		Иначе
			Т =  ТабТовары.Добавить();
			Т.Номенклатура = стр.Номенклатура;
			Т.Упаковка =  стр.Номенклатура.ЕдиницаИзмерения; 
			Т.КоличествоУпаковокФакт = стр.Количество;
			Т.КоличествоФакт = стр.Количество;
			Т.КоличествоУпаковокОтклонение =  0 - стр.Количество;
		КонецЕсли;
	КонецЦикла;
	
	Объект.Товары.Очистить();
	Объект.Товары.Загрузить(ТабТовары); 
	
	Рез.Свернуть("Секция");
	
	Для Каждого стр из Рез Цикл
		НаборЗаписей = РегистрыСведений.СК_БлокировкаСекций.СоздатьНаборЗаписей();  			
		НаборЗаписей.Отбор.ДокументПересчета.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.Секция.Установить(стр.Секция);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 1 Тогда
			НЗапись = НаборЗаписей[0];
			Если НЗапись.Блокировка = Перечисления.СК_СтатусыБлокировокСекций.Завершено Тогда
   				Объект.Комментарий = Объект.Комментарий + Символы.ПС + "Секция " + Строка(стр.Секция) ; 
				НЗапись.Блокировка = Перечисления.СК_СтатусыБлокировокСекций.Передано; 
				НаборЗаписей.Записать();

			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура СК_ЗаполнитьПоОстаткамПосле(Команда)
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("Дата",Объект.Дата);
	//Теперь помещаем эти данные в хранилище и получаем адрес этого хранилища
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	//Создаем структуру с параметрами, которые передадим во вторую форму
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаполнитьПоОстаткам", ЭтаФорма);
	ОткрытьФорму("Документ.ПересчетТоваров.Форма.СК_ПодборПересчета", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаполнитьПоОстаткам(Значение, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Значение) Тогда                  
	    СК_УстановитьОтборПоДокументам(Значение.МассивДокументов);
	    
	    СК_ЗаполнитьСервер();
	    Объект.УчетныеДанныеЗаполнены = Ложь;
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура СК_УстановитьОтборПоДокументам(МассивДок)
	
	ТабНоменклатуры = ТабНоменклатурыДокументов(МассивДок);
	
	СЗ_ДляОтбора = Новый СписокЗначений;

	СЗ_ДляОтбора.ЗагрузитьЗначения(ТабНоменклатуры.ВыгрузитьКолонку("Номенклатура")); // или испльзовать свой массив данных
	

	НовыйОтбор = ОтборПересчета.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
	НовыйОтбор.ПравоеЗначение = СЗ_ДляОтбора; 
	НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	НовыйОтбор.Использование = Истина;

КонецПроцедуры   

&НаСервере
Функция ТабНоменклатурыДокументов(МассивДок)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Различные
	               |	ПересчетТоваровТовары.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
	               |ГДЕ
	               |	ПересчетТоваровТовары.Ссылка В(&Ссылка)";
	Запрос.УстановитьПараметр("Ссылка",МассивДок);
	Возврат Запрос.Выполнить().Выгрузить(); 
 КонецФункции

&НаСервере
Процедура СК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.СК_НомерПересчета = Формат(ТекущаяДата(),"ДФ=MM/yy"); 
	КонецЕсли;
	 
 КонецПроцедуры


