
&НаСервере
Процедура СК_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Если Объект.СК_Основание <> "" Тогда
		ЭтаФорма.Элементы.СК_Основание.Доступность = Ложь; 
		Если ТипЗнч(Объект.СК_Основание) = ТИП("СправочникСсылка.Номенклатура") Тогда
			ЭтаФорма.Элементы.СК_Количество.Видимость = Истина;
		КонецЕсли;
		
	Иначе
		
	КонецЕсли; 
	
	Если Параметры.Ключ.Пустая() Тогда

      Объект.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран;

    КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СК_СК_ОснованиеПриИзмененииВместоНаСервере()
	Если ТипЗнч(Объект.СК_Основание) = ТИП("СправочникСсылка.Номенклатура") Тогда
		ЭтаФорма.Элементы.СК_Количество.Видимость = Истина;  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СК_СК_ОснованиеПриИзмененииВместо(Элемент)
	СК_СК_ОснованиеПриИзмененииВместоНаСервере();
КонецПроцедуры

