
&НаСервере
Процедура СК_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДокСсылка") Тогда
	    ЗаданиеНаПечатьПриИзмененииНаСервере(Параметры.ДокСсылка); 
		Для Каждого НомерСтроки Из Объект.Товары Цикл
			НомерСтроки.Выбран = Истина;
		КонецЦикла;
		
		ЗаполнитьКоличествоЭтикеток();  
		СК_УстановитьНовыеШтрихкодыEAN13НаСервере("");
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура СК_ПечатьВместо(Команда)
	
	ПроверитьШКВТаблице();
	ОчиститьСообщения();
	
	РезультатПроверки = ВыполнитьПроверку(ЭтаФорма);
	Если Не РезультатПроверки.ТоварыВыбраны Тогда
		ТекстСообщения = НСтр("ru = 'Не выбрано ни одного товара'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если РезультатПроверки.ПроверкаВыполнена Тогда
		
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		
		ИменаМакетов = "";
		
		Если Режим = "ПечатьЭтикетокИЦенников" Тогда
			ИменаМакетов = "ЭтикеткаТовары,ЦенникТовары";
		ИначеЕсли Режим = "ПечатьЦенников" Тогда
			ИменаМакетов = "ЦенникТовары";
		ИначеЕсли Режим = "ПечатьЭтикеток" Тогда
			ИменаМакетов = "ЭтикеткаТовары";
		КонецЕсли;
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Обработка.ПечатьЭтикетокИЦенников",
			ИменаМакетов,
			ПараметрКоманды,
			ЭтаФорма,
			ПолучитьПараметры());
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьШКВТаблице()
	
	Для Каждого стр из Объект.Товары Цикл
		
		Если СтрДлина(стр.Штрихкод) < 11 Тогда
			стр.Выбран = Ложь;
		КонецЕсли;
		
	КонецЦикла

КонецПроцедуры


&НаКлиенте
Процедура СК_ВыбратьВыделенныеСтрокиВместо(Команда)
	
	Для Каждого НомерСтроки Из Объект.Товары Цикл
		НомерСтроки.Выбран = Истина;
	КонецЦикла;

КонецПроцедуры


&НаСервере
&Вместо("УстановитьНовыеШтрихкодыEAN13НаСервере")
Функция СК_УстановитьНовыеШтрихкодыEAN13НаСервере(ОписаниеОшибки)
	
	Количество = 0;
	
	МассивСтрок = Элементы.Товары.ВыделенныеСтроки;
	
	Штрихкоды = Новый Соответствие;
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ШтрихкодыНоменклатуры");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
		
		МаксимальныеЗначенияКодовШтучныхШтрихкодов = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьМаксимальныеЗначенияКодовШтучныхШтрихкодов();
		МаксимальноеЗначениеКодаВесовыхШтрихкодов  = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьМаксимальноеЗначениеКодаВесовыхШтрихкодов();
		МаксимальныйКодШтучногоТовара              = РегистрыСведений.ШтрихкодыНоменклатуры.МаксимальныйКодШтучногоТовара();
		МаксимальныйКодВесовогоТовара              = РегистрыСведений.ШтрихкодыНоменклатуры.МаксимальныйКодВесовогоТовара();
		ПрефиксУзлаШтрихкода                       = РегистрыСведений.ШтрихкодыНоменклатуры.ПрефиксУзлаШтрихкода();
		
		Для Каждого СтрокаТЧ Из Объект.Товары Цикл
			//СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
			Если СтрокаТЧ.Выбран= Истина Тогда 
				Если Не ЗначениеЗаполнено(СтрокаТЧ.Штрихкод) Тогда  
					//@skip-check query-in-loop
					ШК =  ПроверитьПолучитьШК(СтрокаТЧ.Номенклатура) ;
					Если ШК = Ложь Тогда
						Количество = Количество + 1;
					Иначе
						СтрокаТЧ.Штрихкод = ШК; 
						Продолжить;
					КонецЕсли;
					
				Иначе
					Продолжить;
				КонецЕсли;
				
				Код = Неопределено;
				Диапазон = Неопределено;
				
				Если Не СтрокаТЧ.Весовой Тогда
					
					Для Каждого СтрокаТЧМаксимальныеЗначения Из МаксимальныеЗначенияКодовШтучныхШтрихкодов Цикл
						
						Если Не СтрокаТЧМаксимальныеЗначения.Код < МаксимальныйКодШтучногоТовара Тогда
							Продолжить;
						КонецЕсли;
						
						СтрокаТЧМаксимальныеЗначения.Код = СтрокаТЧМаксимальныеЗначения.Код + 1;
						
						Код      = СтрокаТЧМаксимальныеЗначения.Код; 
						Диапазон = СтрокаТЧМаксимальныеЗначения.Диапазон;
						
						Прервать;
					КонецЦикла;
					
					Если Код = Неопределено Тогда
						ВызватьИсключение РегистрыСведений.ШтрихкодыНоменклатуры.ТекстСообщенияНетСвободныхКодовШтучныхШтрихкодов();
					КонецЕсли;
					
					Штрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьШтрихкодПоКоду(Код, Диапазон, ПрефиксУзлаШтрихкода);
					
				Иначе
					
					Если МаксимальноеЗначениеКодаВесовыхШтрихкодов = Неопределено ИЛИ МаксимальноеЗначениеКодаВесовыхШтрихкодов >= МаксимальныйКодВесовогоТовара Тогда
						ВызватьИсключение РегистрыСведений.ШтрихкодыНоменклатуры.ТекстСообщенияНетСвободныхКодовВесовыхШтрихкодов();
					КонецЕсли;
						
					МаксимальноеЗначениеКодаВесовыхШтрихкодов = МаксимальноеЗначениеКодаВесовыхШтрихкодов + 1;
					
					Штрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьШтрихкодВесовогоТовараПоКоду(МаксимальноеЗначениеКодаВесовыхШтрихкодов, ПрефиксУзлаШтрихкода);
					
				КонецЕсли;
			    Если Не ЗначениеЗаполнено(СтрокаТЧ.Штрихкод) Тогда	
					НовыйШтрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
					НовыйШтрихкод.Номенклатура = СтрокаТЧ.Номенклатура; 
					Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
						НовыйШтрихкод.Характеристика = СтрокаТЧ.Характеристика;
					КонецЕсли;
					Если ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда
						НовыйШтрихкод.Упаковка = СтрокаТЧ.Упаковка;
					КонецЕсли;
					НовыйШтрихкод.Штрихкод = Штрихкод;
					НовыйШтрихкод.Записать();
					
					Если СтрокаТЧ.Весовой Тогда
						Штрихкоды.Вставить(СтрокаТЧ, РегистрыСведений.ШтрихкодыНоменклатуры.ПодготовитьШтрихкод(НовыйШтрихкод.Штрихкод));
					Иначе
						Штрихкоды.Вставить(СтрокаТЧ, НовыйШтрихкод.Штрихкод);
					КонецЕсли;  
				КонецЕсли;
			КонецЕсли;			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ОписаниеОшибки = НСтр("ru = 'При записи штрихкодов произошла ошибка.
		                      |Запись штрихкодов не выполнена.
		                      |Дополнительное описание:
		                      |%ДополнительноеОписание%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", ИнформацияОбОшибке().Описание);
		
		Возврат 0;
		
	КонецПопытки;
	
	Для Каждого КлючИЗначение Из Штрихкоды Цикл
		КлючИЗначение.Ключ.Штрихкод = КлючИЗначение.Значение;
	КонецЦикла;
	
	Возврат Количество;

КонецФункции

&НаСервере
Функция  ПроверитьПолучитьШК(Ном)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура",Ном); 
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Штрихкод;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


&НаСервере
Функция  ОстатокВЯчейках(ШК)   

	Ост = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(СК_ТоварыНаСкладахОстатки.ВналичииОстаток) КАК ВналичииОстаток
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |		ПО СК_ТоварыНаСкладахОстатки.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	               |	И СК_ТоварыНаСкладахОстатки.ВналичииОстаток >= &ВналичииОстаток";
	Запрос.УстановитьПараметр("Штрихкод",ШК);
	Запрос.УстановитьПараметр("ВналичииОстаток",1);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Если ТипЗнч(Рез.ВналичииОстаток) = Тип("Null") Тогда
			Ост = 0;
		Иначе
			Ост = Рез.ВналичииОстаток;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ост;
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьКоличествоЭтикеток()
	Для каждого стр из Объект.Товары Цикл 
		Если стр.Выбран = Истина И СтрДлина(стр.Штрихкод) > 10 Тогда  
			Если стр.ОстатокНаСкладе = 0 Тогда
				стр.КоличествоЭтикеток = 1 ;
			Иначе
				//@skip-check query-in-loop
				остЯчейка = ОстатокВЯчейках(стр.Штрихкод);
				стр.КоличествоЭтикеток = стр.ОстатокНаСкладе - остЯчейка;
			КонецЕсли;
		КонецЕсли;
    КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура СК_УстановитьШаблонЭтикетокВместо(Команда)
	
	ЗаполнитьКоличествоЭтикеток();
	
	МассивСтрок = Новый Массив;
	
	Для каждого стр из Объект.Товары Цикл 
		Если стр.Выбран = Истина И СтрДлина(стр.Штрихкод) > 10 Тогда
			МассивСтрок.Добавить(стр);
       		//Элементы.Товары.ВыделенныеСтроки.Добавить(стр.НомерСтроки);
		КонецЕсли;
    КонецЦикла;

	//МассивСтрок = Элементы.Товары.ВыделенныеСтроки;

	Если МассивСтрок.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'В списке отсутствуют выделенные строки'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("Отбор", Новый Структура("Назначение", ПредопределенноеЗначение("Перечисление.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров")));
	
	ДопПараметры = Новый Структура("МассивСтрок", МассивСтрок);
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьШаблонЭтикетокЗавершение", ЭтотОбъект, ДопПараметры);
	ОткрытьФорму("Справочник.ШаблоныЭтикетокИЦенников.ФормаВыбора",
		ПараметрыФормыВыбора, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры


&НаКлиенте
&Вместо("УстановитьШаблонЭтикетокЗавершение")
Процедура СК_УстановитьШаблонЭтикетокЗавершение(Результат, ДополнительныеПараметры)
	
	МассивСтрок = ДополнительныеПараметры.МассивСтрок;
	
	ВыбранноеЗначение = Результат;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Для каждого стр из Объект.Товары Цикл 
			Если стр.Выбран = Истина И СтрДлина(стр.Штрихкод) > 10 Тогда
				стр.ШаблонЭтикетки = ВыбранноеЗначение;       		//Элементы.Товары.ВыделенныеСтроки.Добавить(стр.НомерСтроки);
			КонецЕсли;
	    КонецЦикла;
	КонецЕсли;
	
	//ОбновитьВидимостьЗависимыхОтШаблонаПолей();

КонецПроцедуры


&НаКлиенте
Процедура СК_ЗаданиеНаПечатьПриИзмененииПосле(Элемент)
	//ЗаданиеНаПечатьПриИзмененииНаСервере(); 

	//Для Каждого НомерСтроки Из Объект.Товары Цикл
	//	НомерСтроки.Выбран = Истина;
	//КонецЦикла;
	//
	//ЗаполнитьКоличествоЭтикеток();  
	//СК_УстановитьНовыеШтрихкодыEAN13НаСервере("");

КонецПроцедуры  


&НаКлиенте
Процедура СК_Группа1ПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)   
	Если ТекущаяСтраница.Имя = "СтраницаЗаданий" Тогда
		ЗаполнитьТаблицуЗаданий();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЗаданий()

	ЭтаФорма.СписокЗаданий.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ЗаданиеНаПечать.Ссылка КАК Ссылка,
	               |	СК_ЗаданиеНаПечать.Дата КАК Дата
	               |ИЗ
	               |	Документ.СК_ЗаданиеНаПечать КАК СК_ЗаданиеНаПечать
	               |ГДЕ
	               |	СК_ЗаданиеНаПечать.Проведен = &Проведен
	               |	И СК_ЗаданиеНаПечать.ПометкаУдаления = &ПометкаУдаления
	               |	И СК_ЗаданиеНаПечать.Выполнено = &Выполнено
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";
	Запрос.УстановитьПараметр("Проведен",Истина);
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	Запрос.УстановитьПараметр("Выполнено",Ложь); 
	
	Таб = Запрос.Выполнить().Выгрузить();
	
	Для Каждого стр из Таб Цикл
		Т = ЭтаФорма.СписокЗаданий.Добавить();
		Т.Задание = стр.Ссылка;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СК_СписокЗаданийВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    ЗаданиеНаПечатьПриИзмененииНаСервере(Элемент.ТекущиеДанные.Задание); 
	Для Каждого НомерСтроки Из Объект.Товары Цикл
		НомерСтроки.Выбран = Истина;
	КонецЦикла;
	
	ЗаполнитьКоличествоЭтикеток();  
	СК_УстановитьНовыеШтрихкодыEAN13НаСервере("");

	ПереходНаСтраницу = ЭтаФорма.Элементы.Группа1.ПодчиненныеЭлементы.Найти("СтраницаТовары");
	ЭтаФорма.Элементы.Группа1.ТекущаяСтраница = ПереходНаСтраницу; 	

КонецПроцедуры


&НаСервере
Процедура ЗаданиеНаПечатьПриИзмененииНаСервере(Д)
	Объект.Товары.Очистить(); 
	Док = Д.ПолучитьОбъект();
	//Док = ЭтаФорма.ЗаданиеНаПечать.ПолучитьОбъект();
	//
	Для Каждого стр из Док.Товары Цикл
		Т = Объект.Товары.Добавить();
		Т.Номенклатура = стр.Номенклатура;
		Т.Упаковка = стр.Номенклатура.ЕдиницаИзмерения.Ссылка; 
		Т.КоличествоВДокументе =стр.Количество;
		Т.КоличествоЭтикеток =стр.Количество; 
		Т.ШаблонЭтикетки = Справочники.ШаблоныЭтикетокИЦенников.НайтиПоНаименованию("43х25_1");
	КонецЦикла;
	
		
КонецПроцедуры

&НаКлиенте
Процедура СК_Обновить(Команда)
	ЗаполнитьТаблицуЗаданий();
КонецПроцедуры

&НаКлиенте
Процедура СК_СписокЗаданийПриАктивизацииСтрокиПосле(Элемент) 
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		СК_СписокЗаданийПриАктивизацииСтрокиПослеНаСервере(Элемент.ТекущиеДанные.Задание);
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура СК_СписокЗаданийПриАктивизацииСтрокиПослеНаСервере(Док)  
	ЭтаФорма.ЗаданиеНаПечать = Док.Ссылка;
	Если Не ЭтаФорма.ЗаданиеНаПечать.Пустая() Тогда
		Задание.Параметры.УстановитьЗначениеПараметра("Ссылка", Док.Ссылка);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СК_ЗаершитьВместоНаСервере()
	Док = ЗаданиеНаПечать.ПолучитьОбъект();
	Док.Выполнено = Истина;
	Док.Записать(РежимЗаписиДокумента.Проведение); 

	Задание.Параметры.УстановитьЗначениеПараметра("Ссылка", Документы.СК_ЗаданиеНаПечать.ПустаяСсылка());
   	ЭтаФорма.ЗаданиеНаПечать = Документы.СК_ЗаданиеНаПечать.ПустаяСсылка();

	ЗаполнитьТаблицуЗаданий() ;

КонецПроцедуры

&НаКлиенте
Процедура СК_Заершить(Команда)
	СК_ЗаершитьВместоНаСервере(); 
	
КонецПроцедуры



