

&НаКлиенте
Перем ВыбДок; //Массив, хранящий отмеченную галочками номенклатуру для отображения в списке




&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Инициализация массива
	ВыбДок = Новый Массив;
	
	//Без параметра, даже пустого, список выдаст ошибку и будет прав 
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ВыбДок", ВыбДок);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//Нас интересует только событие нажатия на чекбокс
	Если Поле = Элементы.СписокДокументовПометка Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			Если ТекущиеДанные.Пометка Тогда
				СнятьПометку(ТекущиеДанные.Ссылка);
			Иначе
				ПоставитьПометку(ТекущиеДанные.Ссылка);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	//Параметр в динамическом списке нужно обновить
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ВыбДок", ВыбДок);
	
	Элементы.СписокДокументов.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометку(Ссылка)
	Индекс = ВыбДок.Найти(Ссылка);
	Если Индекс >= 0 Тогда
		ВыбДок.Удалить(Индекс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьПометку(Ссылка)
	Индекс = ВыбДок.Найти(Ссылка);
	Если Индекс = Неопределено Тогда
		ВыбДок.Добавить(Ссылка);
	КонецЕсли;
КонецПроцедуры   


&НаКлиенте
Процедура Выбор(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура СписокДокументовПометкаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);


	Если СтруктураПараметров.Дата <> "" Тогда  
		Период.ДатаНачала =  НачалоМесяца(НачалоДня(СтруктураПараметров.Дата));
		Период.ДатаОкончания =  КонецМесяца(КонецДня(СтруктураПараметров.Дата));
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоМесяца(НачалоДня(СтруктураПараметров.Дата)));
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецМесяца(КонецДня(СтруктураПараметров.Дата)));
	Иначе
		Сообщить("Не удалось создать документ отгрузки");	
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("МассивДокументов",ВыбДок);
	ОповеститьОВыборе(СтуктураВозврат); 

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ЭтаФорма.Период.ДатаНачала);
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ЭтаФорма.Период.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	ОтметитьВсеНаСервере()
КонецПроцедуры


&НаСервере
Процедура ОтметитьВсеНаСервере()
	
КонецПроцедуры





