#Область ПроверкиВведеннойИнформации

&ВМесто("ПервичнаяИнформацияЗаполненаНеправильно")  
&НаКлиенте
Функция СК_ПервичнаяИнформацияЗаполненаНеправильно()
	
	Отказ = Ложь;
	ОчиститьСообщения();
	
	Если ЭтоКомпания = 0 Тогда
		Если ИспользуютсяТолькоПартнеры Тогда
			Если ПустаяСтрока(ПолноеЮридическоеНаименование) Тогда
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указано сокращенное юр. наименование партнера'"), ИспользуютсяТолькоПартнеры, "ПолноеЮридическоеНаименование");
				Отказ = Истина;
			КонецЕсли;
		Иначе
			Если ПустаяСтрока(ПолноеНаименование) Тогда
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указано публичное наименование партнера'"), ИспользуютсяТолькоПартнеры, "ПолноеНаименование");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ЭтоКомпания = 1 Тогда
		Если ПустаяСтрока(ФамилияПартнера) Тогда
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указано фамилия партнера'"), ИспользуютсяТолькоПартнеры, "ФамилияПартнера");
			Отказ = Истина;
		КонецЕсли;
		Если ПустаяСтрока(ИмяПартнера) Тогда
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указано имя партнера'"), ИспользуютсяТолькоПартнеры, "ИмяПартнера");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли; 
	
	ОбязательностьКонтактнойИнформацииОтработана = Ложь;
	
	Если ЭтоКомпания = 0 Тогда
		
		//Если АдресЭППартнераОбязателен
		//	И Не ЗначениеЗаполнено(АдресЭППартнера) Тогда
		//	
		//	ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать адрес электронной почты партнера'"),ИспользуютсяТолькоПартнеры, "АдресЭППартнера");
		//	Отказ = Истина;
		//	ОбязательностьКонтактнойИнформацииОтработана = Истина;
		//	
		//КонецЕсли;
		
		Если ТелефонПартнераОбязателен
			И Не ЗначениеЗаполнено(ТелефонПартнера) Тогда
			
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать телефон партнера'"),ИспользуютсяТолькоПартнеры, "ТелефонПартнера");
			Отказ = Истина;
			ОбязательностьКонтактнойИнформацииОтработана = Истина;
			
		КонецЕсли;
		
		Если УказатьДанныеКонтактногоЛица Тогда
			
			Если АдресЭПКонтактногоЛицаОбязателен
				И Не ЗначениеЗаполнено(АдресЭПКЛ) Тогда
				
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать адрес электронной почты контактного лица'"), ИспользуютсяТолькоПартнеры, "АдресЭПКЛ");
				Отказ = Истина;
				ОбязательностьКонтактнойИнформацииОтработана = Истина;
				
			КонецЕсли;
			
			Если ТелефонКонтактногоЛицаОбязателен 
				И Не ЗначениеЗаполнено(ТелефонКЛ) Тогда
				
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать телефон контактного лица'"), ИспользуютсяТолькоПартнеры, "ТелефонКЛ");
				Отказ = Истина;
				ОбязательностьКонтактнойИнформацииОтработана = Истина;
				
			КонецЕсли;
			
			Если МобильныйТелефонКонтактногоЛицаОбязателен 
				И Не ЗначениеЗаполнено(МобильныйТелефонКЛ) Тогда
				
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать мобильный телефон контактного лица'"), ИспользуютсяТолькоПартнеры, "МобильныйТелефонКЛ");
				Отказ = Истина;
				ОбязательностьКонтактнойИнформацииОтработана = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//Если Не ОбязательностьКонтактнойИнформацииОтработана 
		//	И ПустаяСтрока(АдресЭППартнера)
		//	И ПустаяСтрока(ТелефонПартнера) Тогда
		//	
		//	Если (УказатьДанныеКонтактногоЛица) Тогда
		//		
		//		Если ПустаяСтрока(ТелефонКЛ) И ПустаяСтрока(МобильныйТелефонКЛ) Тогда// И ПустаяСтрока(АдресЭПКЛ) Тогда
		//			
		//			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать хотя бы одно значение контактной информации'"),ИспользуютсяТолькоПартнеры, "АдресЭППартнера");
		//			Отказ = Истина;
		//			
		//		КонецЕсли;
		//		
		//	Иначе
		//		
		//		ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать хотя бы одно значение контактной информации'"),ИспользуютсяТолькоПартнеры, "АдресЭППартнера");
		//		Отказ = Истина;
		//		
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
	Иначе
		
		Если (АдресЭППартнераОбязателен
			Или ВариантОтправкиЭлектронногоЧека = ПредопределенноеЗначение("Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail"))
			И Не ЗначениеЗаполнено(АдресЭППартнераФизЛицо) Тогда
			
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать адрес электронной почты партнера'"),ИспользуютсяТолькоПартнеры, "АдресЭППартнераФизЛицо");
			Отказ = Истина;
			ОбязательностьКонтактнойИнформацииОтработана = Истина;
			
		КонецЕсли;
		
		Если (ТелефонПартнераОбязателен
			Или ВариантОтправкиЭлектронногоЧека = ПредопределенноеЗначение("Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьSMS"))
			И Не ЗначениеЗаполнено(ТелефонПартнераФизЛицо) Тогда
			
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать телефон партнера'"),ИспользуютсяТолькоПартнеры, "ТелефонПартнераФизЛицо");
			Отказ = Истина;
			ОбязательностьКонтактнойИнформацииОтработана = Истина;
			
		КонецЕсли;
		
		Если Не ОбязательностьКонтактнойИнформацииОтработана
			И ПустаяСтрока(АдресЭППартнераФизЛицо) И ПустаяСтрока(ТелефонПартнераФизЛицо) Тогда
			
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать хотя бы одно значение контактной информации'"),ИспользуютсяТолькоПартнеры, "АдресЭППартнераФизЛицо");
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если УказыватьЮридическиеРеквизиты Тогда
		
		Если Не ИспользуютсяТолькоПартнеры И ЭтоКомпания = 0 Тогда
			Если ПустаяСтрока(ПолноеЮридическоеНаименование) Тогда
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указано сокращенное юр. наименование'"),ИспользуютсяТолькоПартнеры, "НаименованиеКонтрагента");
				Отказ = Истина; 
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоКомпания = 1 И УказыватьЮридическиеРеквизиты И УказатьДокументУдостоверяющийЛичность Тогда
			Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
				ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указано вид документа удостоверяющего личность'"),ИспользуютсяТолькоПартнеры, "ВидДокумента");
				Отказ = Истина
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если УказатьДанныеКонтактногоЛица И ЭтоКомпания = 0 Тогда
		
		Если ПустаяСтрока(ФамилияКЛ) Тогда
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указана фамилия контактного лица'"),ИспользуютсяТолькоПартнеры, "ФамилияКЛ");
			Отказ = Истина;
		КонецЕсли;
		
		Если ПустаяСтрока(ИмяКл) Тогда
			ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Не указано имя контактного лица'"),ИспользуютсяТолькоПартнеры, "ИмяКЛ");
			Отказ = Истина;
		КонецЕсли;
		
		//Если ПустаяСтрока(ТелефонКЛ) И ПустаяСтрока(АдресЭПКЛ) И ПустаяСтрока(МобильныйТелефонКЛ) Тогда
		//	ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать хотя бы одно значение контактной информации контактного лица'"),ИспользуютсяТолькоПартнеры, "АдресЭПКЛ");
		//	Отказ = Истина;
		//КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		// проверка корректности адресов электронной почты
		//Если  НЕ ПустаяСтрока(АдресЭППартнера) И ЭтоКомпания = 0 Тогда
		//	Если ОбщегоНазначенияУТКлиентСервер.ПроверитьЗаполнениеПочтовогоАдреса(АдресЭППартнера) Тогда
		//		ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Неверный формат адреса электронной почты партнера'"), ИспользуютсяТолькоПартнеры, "АдресЭППартнера");
		//		Отказ = Истина;
		//	КонецЕсли;
		//КонецЕсли;
		//
		//Если  НЕ ПустаяСтрока(АдресЭППартнераФизЛицо) И ЭтоКомпания = 1 Тогда
		//	Если ОбщегоНазначенияУТКлиентСервер.ПроверитьЗаполнениеПочтовогоАдреса(АдресЭППартнераФизЛицо) Тогда
		//		ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Неверный формат адреса электронной почты партнера'"), ИспользуютсяТолькоПартнеры, "АдресЭППартнераФизЛицо");
		//		Отказ = Истина;
		//	КонецЕсли;
		//КонецЕсли;
		//
		//Если  УказатьДанныеКонтактногоЛица И НЕ ПустаяСтрока(АдресЭПКЛ) И ЭтоКомпания = 0 Тогда
		//	Если ОбщегоНазначенияУТКлиентСервер.ПроверитьЗаполнениеПочтовогоАдреса(АдресЭПКЛ) Тогда
		//		ПартнерыИКонтрагентыКлиент.ВывестиСообщениеПользователю(НСтр("ru = 'Неверный формат адреса электронной почты контактного лица'"), ИспользуютсяТолькоПартнеры, "АдресЭПКЛ");
		//		Отказ = Истина;
		//	КонецЕсли;
		//КонецЕсли;
		
		// Проверка данных физического лица
		Если  ЭтоКомпания = 1 И УказыватьЮридическиеРеквизиты И УказатьДокументУдостоверяющийЛичность Тогда
			
			Если Не ПустаяСтрока(СерияДокумента) Тогда
				ТекстОшибки = "";
				Отказ = Не ФизическиеЛицаКлиентСерверУТ.СерияДокументаУказанаПравильно(ВидДокумента, СерияДокумента, ТекстОшибки) Или Отказ;
				Если Не ПустаяСтрока(ТекстОшибки) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "СерияДокумента");
				КонецЕсли;
			КонецЕсли;
			
			Если Не ПустаяСтрока(НомерДокумента) Тогда
				ТекстОшибки = "";
				Отказ = Не ФизическиеЛицаКлиентСерверУТ.НомерДокументаУказанПравильно(ВидДокумента, НомерДокумента, ТекстОшибки) Или Отказ;
				Если Не ПустаяСтрока(ТекстОшибки) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "НомерДокумента");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПартнерыИКонтрагентыЛокализацияКлиент.ПервичнаяИнформацияЗаполненаНеправильно(ЭтотОбъект, Отказ);
	Возврат Отказ;
	
КонецФункции  

#КонецОбласти

