&НаСервере
Процедура СохранитьНаСервере()
	АдресСервера = Константы.СК_БухСервер.СоздатьМенеджерЗначения();
	АдресСервера.Прочитать();
	АдресСервера.Значение = Объект.АдресСервера; 
	АдресСервера.Записать();
	
	Пользователь = Константы.СК_БухПользователь.СоздатьМенеджерЗначения();
	Пользователь.Прочитать();
	Пользователь.Значение = Объект.Пользователь;
	Пользователь.Записать();
	
	Пароль = Константы.СК_БухПароль.СоздатьМенеджерЗначения();
	Пароль.Прочитать();
	Пароль.Значение = Объект.Пароль;
	Пароль.Записать();

	БухБД = Константы.СК_БухБД.СоздатьМенеджерЗначения();
	БухБД.Прочитать();
	БухБД.Значение = Объект.АдресБД;
	БухБД.Записать();
	
КонецПроцедуры



&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере()
КонецПроцедуры
