Функция ПолучитьЯчейкиПоКоличеству(Номенклатура,Количество) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
	|	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	|ИЗ
	|	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	|ГДЕ
	|	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВналичииОстаток";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура); 
	Рез = Запрос.Выполнить().Выбрать();
	
	Мас = Новый Массив;
	Кол = 0;	
	Пока Рез.Следующий() Цикл
		СЗ = Новый Структура;           
		Сз.Вставить("Ячейка",Строка(Рез.Ячейка));
		Сз.Вставить("ВналичииОстаток",Рез.ВналичииОстаток);
		Мас.Добавить(СЗ);   
		
		Кол = Кол + Рез.ВналичииОстаток;				
		
		Если Кол >= Количество Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Мас;
	
КонецФункции


Функция ПреобразоватьМассивВТаблицуЗначений(мсДанные) Экспорт
    тзДанные = Новый ТаблицаЗначений;
    Для Каждого ЭлементМассива Из мсДанные Цикл
			Если тзДанные.Колонки.Количество() = 0 Тогда
	            Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
	                тзДанные.Колонки.Добавить(ЗначениеСтруктуры.Ключ);
	            КонецЦикла
	        КонецЕсли;
	        НоваяСтрока = тзДанные.Добавить();
	        Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
	            НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
			КонецЦикла
    КонецЦикла;
    Возврат тзДанные;
КонецФункции


Функция ПолучитьОстаток(Номенклатура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
	|	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	|ИЗ
	|	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	|ГДЕ
	|	СК_ТоварыНаСкладахОстатки.Номенклатура В (&Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВналичииОстаток";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура); 
	Рез = Запрос.Выполнить().Выгрузить();

	Возврат Рез;
	
КонецФункции 

Функция ПолучитьОстатокНоменклатураЯчейка(Номенклатура,Ячейка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
	               |	СУММА(СК_ТоварыНаСкладахОстатки.ВналичииОстаток) КАК ВналичииОстаток
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
	               |	И СК_ТоварыНаСкладахОстатки.Ячейка = СК_ТоварыНаСкладахОстатки.Ячейка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВналичииОстаток";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура); 
	Запрос.УстановитьПараметр("Ячейка",Ячейка); 
	Рез = Запрос.Выполнить().Выгрузить();

	Возврат Рез;
	
КонецФункции  

Функция ПоискШтрихКодаПоНоменклатуре(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
|ИЗ
|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
|ГДЕ
|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


Функция ПолучитьОстатокНоменклатураСклад(Номенклатура,Склад,ДатаЗапроса) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаЗапроса,Склад = &Склад И Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки
	               |";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура); 
	Запрос.УстановитьПараметр("Склад",Склад); 
	Запрос.УстановитьПараметр("ДатаЗапроса",ДатаЗапроса); 
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.ВНаличииОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;
	
	
КонецФункции 


Функция ПолучитьДокументСборки(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СК_СписаниеСклад.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СК_СписаниеСклад КАК СК_СписаниеСклад
	               |ГДЕ
	               |	СК_СписаниеСклад.ДокументОснования = &ДокументОснования
	               |	И СК_СписаниеСклад.СтатусСборки = ЗНАЧЕНИЕ(Перечисление.СК_СтатусСборкиРеализации.Собран)
	               |	И СК_СписаниеСклад.Проведен = &Проведен
	               |	И СК_СписаниеСклад.ПометкаУдаления = &ПометкаУдаления";   
	
	Запрос.УстановитьПараметр("ДокументОснования",Ссылка);
	Запрос.УстановитьПараметр("Проведен",Истина);
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	КонецЕсли;
	
	
КонецФункции
