
&Вместо("СформироватьXML")
Функция СК_СформироватьXML(УзелОбмена)
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьXML = Новый ЗаписьXML;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("xml");
	ЗаписьXML.ОткрытьФайл(ИмяФайла, "UTF-8");
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);					
	
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");
	
	ТипДанныхУдаления = Тип("УдалениеОбъекта");
	
	//ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения);
	//Пока ВыборкаИзменений.Следующий() Цикл
	//	
	//	Данные = ВыборкаИзменений.Получить();
	//	
	//	// Если перенос данных не нужен, то, возможно, необходимо записать удаление данных
	//	Если НЕ ОбменМобильныеПереопределяемый.НуженПереносДанных(Данные, УзелОбмена) Тогда
	//		
	//		// Получаем значение с возможным удалением данных
	//		УдалениеДанных(Данные); 
	//		
	//	КонецЕсли;	
	//	
	//	// Записываем данные в сообщение
	//	ОбменМобильныеПереопределяемый.ЗаписатьДанные(ЗаписьXML, Данные);
	//	
	//КонецЦикла;
	
	ЗаписьСообщения.ЗакончитьЗапись();
	
	ЗаписьXML.Закрыть();
	
	Возврат ИмяФайла;

КонецФункции
