
&НаСервере
Процедура СК_ЗагрузитьИзТСДВместоНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_Инвентаризация.Номенклатура КАК Номенклатура,
	               |	СК_Инвентаризация.Количество КАК Количество,
	               |	СК_БлокировкаСекций.Секция КАК Секция
	               |ИЗ
	               |	РегистрСведений.СК_БлокировкаСекций КАК СК_БлокировкаСекций
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СК_Инвентаризация КАК СК_Инвентаризация
	               |		ПО СК_БлокировкаСекций.Секция = СК_Инвентаризация.Ячейка.Секция
	               |			И СК_БлокировкаСекций.ДокументПересчета = СК_Инвентаризация.ДокументПересчета
	               |ГДЕ
	               |	СК_БлокировкаСекций.Блокировка = ЗНАЧЕНИЕ(Перечисление.СК_СтатусыБлокировокСекций.Завершено)
	               |	И СК_БлокировкаСекций.ДокументПересчета = &ДокументПересчета";
	Запрос.УстановитьПараметр("ДокументПересчета",Объект.Ссылка);
	Рез = Запрос.Выполнить().Выгрузить(); 
	ТабТовары = Объект.Товары.Выгрузить();
	
	Для Каждого стр из Рез Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",стр.Номенклатура);
		Строки = ТабТовары.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда
			Строки[0].КоличествоФакт = стр.Количество; 
			Строки[0].КоличествоУпаковокФакт = стр.Количество; 
			Строки[0].КоличествоУпаковокОтклонение =  стр.Количество-Строки[0].КоличествоУпаковок;
		Иначе
			Т =  ТабТовары.Добавить();
			Т.Номенклатура = стр.Номенклатура;
			Т.Упаковка =  стр.Номенклатура.ЕдиницаИзмерения; 
			Т.КоличествоУпаковокФакт = стр.Количество;
			Т.КоличествоФакт = стр.Количество;
			Т.КоличествоУпаковокОтклонение =  0 - стр.Количество;
		КонецЕсли;
	КонецЦикла;
	
	Объект.Товары.Очистить();
	Объект.Товары.Загрузить(ТабТовары); 
	
	Рез.Свернуть("Секция");
	
	Для Каждого стр из Рез Цикл
		НаборЗаписей = РегистрыСведений.СК_БлокировкаСекций.СоздатьНаборЗаписей();  			
		НаборЗаписей.Отбор.ДокументПересчета.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.Секция.Установить(стр.Секция);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 1 Тогда
			НЗапись = НаборЗаписей[0];
			Если НЗапись.Блокировка = Перечисления.СК_СтатусыБлокировокСекций.Завершено Тогда

				НЗапись.Блокировка = Перечисления.СК_СтатусыБлокировокСекций.Передано; 
				НаборЗаписей.Записать();

			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	

КонецПроцедуры

&НаКлиенте
Процедура СК_ЗагрузитьИзТСДВместо(Команда)
	СК_ЗагрузитьИзТСДВместоНаСервере();
КонецПроцедуры
