
//&НаКлиенте
//Процедура ВаловаПрибыль(Команда)
//	ПараметрыОткрытия = Новый Структура("СформироватьПриОткрытии", Истина);
//	//ПараметрыОткрытия.Вставить("Отбор", Новый Структура("Номенклатура",ПредопределенноеЗначение("Справочник.Номенклатура.Товар1")));
//	ОткрытьФорму("Отчет.ВыручкаИСебестоимостьПродаж.Форма",ПараметрыОткрытия,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

//КонецПроцедуры

//&НаКлиенте
//Процедура ЗадолженностьКлиентов(Команда)
//	ПараметрыОткрытия = Новый Структура("СформироватьПриОткрытии", Истина);
//	//ПараметрыОткрытия.Вставить("Отбор", Новый Структура("Номенклатура",ПредопределенноеЗначение("Справочник.Номенклатура.Товар1")));
//	ОткрытьФорму("Отчет.ЗадолженностьКлиентов.Форма",ПараметрыОткрытия,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗадолженностьПоставщикам(Команда)
//	ПараметрыОткрытия = Новый Структура("СформироватьПриОткрытии", Истина);
//	//ПараметрыОткрытия.Вставить("Отбор", Новый Структура("Номенклатура",ПредопределенноеЗначение("Справочник.Номенклатура.Товар1")));
//	ОткрытьФорму("Отчет.ЗадолженностьПоставщикам.Форма",ПараметрыОткрытия,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьГруппаПотребность()
//	ТЧПотребность.Очистить();
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	                      |	СК_Потребность.Номенклатура КАК Номенклатура,
//	                      |	СК_Потребность.Количество КАК Количество,
//	                      |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
//	                      |ИЗ
//	                      |	РегистрСведений.СК_Потребность КАК СК_Потребность
//	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
//	                      |		ПО СК_Потребность.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
//	                      |			И СК_Потребность.Склад = ТоварыНаСкладахОстатки.Склад
//	                      |ГДЕ
//	                      |	СК_Потребность.Активно = &Активно
//	                      |	И СК_Потребность.Склад = &Склад";   
//	Запрос.УстановитьПараметр("Склад",ЭтаФорма.Склад.Ссылка);
//	Запрос.УстановитьПараметр("Активно",Истина);  
//	//ТЧПотребность = Запрос.Выполнить().Выгрузить();

//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ГруппаСтартПриСменеСтраницы(Элемент, ТекущаяСтраница) 
//	Если ТекущаяСтраница.Имя = "ГруппаПотребность" Тогда
//		Склад = СкладПоУмолчанию();
//		ЗаполнитьГруппаПотребность();
//	КонецЕсли;
//	
//КонецПроцедуры


//&НаСервере
//Функция  СкладПоУмолчанию()
//	Возврат Справочники.Склады.НайтиПоНаименованию("Основной склад");
//КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ПроверитьДоступ() Тогда
		ЭтаФорма.Закрыть();
	Иначе
		//ОткрытьФорму("Отчет.СК_Отчет.Форма");
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры  

//&НаСервере
//Процедура УстановитьПараметры()
//    ЭтаФорма.Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
//    ЭтаФорма.Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
//	ПродажиМенеджерНаСервере();	
//КонецПроцедуры


&НаСервере
Функция ПроверитьДоступ()
	ТекП = Пользователи.АвторизованныйПользователь(); 
	Руководство = Справочники.ГруппыПользователей.НайтиПоНаименованию("Руководство"); 

	Отбор = Новый Структура;
	Отбор.Вставить("Пользователь",ТекП);
	Строка = Руководство.Состав.НайтиСтроки(Отбор);                               
	Если Строка.Количество() >=1 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции 







//Функция НаборПродаж()
//	ДатаОкончания = ЭтаФорма.Период.ДатаОкончания;	
//	ДатаНачала =  ЭтаФорма.Период.ДатаНачала; 


//	Таб = Новый ТаблицаЗначений; 
//	
//	
//	Таб.Очистить();

//	ЗапросВыпуск = Новый Запрос;
//	ЗапросВыпуск.Текст = "ВЫБРАТЬ
//	                     |	ВыручкаИСебестоимостьПродаж.ЗаказКлиента КАК ЗаказыКлиентов,
//	                     |	СУММА(0) КАК Оплата,
//	                     |	СУММА(0) КАК Закупка,
//	                     |	СУММА(ВыручкаИСебестоимостьПродаж.Количество) КАК Количество,
//	                     |	СУММА(ВыручкаИСебестоимостьПродаж.СуммаВыручки) КАК Продажи
//	                     |ИЗ
//	                     |	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
//	                     |ГДЕ
//	                     |	ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
//	                     |
//	                     |СГРУППИРОВАТЬ ПО
//	                     |	ВыручкаИСебестоимостьПродаж.ЗаказКлиента";
//	
//	ЗапросВыпуск.УстановитьПараметр("ДатаНачала",ДатаНачала);
//	ЗапросВыпуск.УстановитьПараметр("ДатаОкончания",ДатаОкончания);
//	
//	Результат = ЗапросВыпуск.Выполнить();
//	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
//	Таб = Результат.Выгрузить(СпособОбхода);   

//ТОтбор = Новый ТаблицаЗначений;
//ТОтбор = Таб.Скопировать(,"ЗаказыКлиентов");
//	
////
//	ЗапросОплат = Новый Запрос;
//	ЗапросОплат.Текст = "ВЫБРАТЬ
//	                    |	ПоступлениеБезналичныхДенежныхСредств.Сумма КАК СуммаОплаты,
//	                    |	ПоступлениеБезналичныхДенежныхСредств.Ссылка КАК Ссылка,	
//	                    |	ПоступлениеБезналичныхДенежныхСредств.ОснованиеПлатежа КАК ОснованиеПлатежа,	
//	                    |	ПоступлениеБезналичныхДенежныхСредств.ОбъектРасчетов КАК ОбъектРасчетов	
//	                    |ИЗ
//	                    |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредств
//	                    |ГДЕ
//	                    |	ПоступлениеБезналичныхДенежныхСредств.Ссылка.ПометкаУдаления = &ПометкаУдаления
//	                    |	И ПоступлениеБезналичныхДенежныхСредств.Ссылка.Проведен = &Проведен
//	                    |	И (ПоступлениеБезналичныхДенежныхСредств.ОснованиеПлатежа В (&ОснованиеПлатежа)
//	                    |			ИЛИ ПоступлениеБезналичныхДенежныхСредств.ОбъектРасчетов В (&ОснованиеПлатежа))";
//	
//	ЗапросОплат.УстановитьПараметр("ПометкаУдаления",Ложь);
//	ЗапросОплат.УстановитьПараметр("Проведен",Истина);
//	ЗапросОплат.УстановитьПараметр("ОснованиеПлатежа",ТОтбор);

//	
//	РезультатОплат = ЗапросОплат.Выполнить();
//	ТабОпл = РезультатОплат.Выгрузить(СпособОбхода); 
//	
////
//	ЗапросПоступл = Новый Запрос;
//	ЗапросПоступл.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
//	                      |	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
//	                      |	СУММА(СебестоимостьТоваров.Стоимость) КАК Стоимость,
//	                      |	СУММА(СебестоимостьТоваров.Количество) КАК Количество,
//	                      |	СебестоимостьТоваров.Период КАК Период
//	                      |ИЗ
//	                      |	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
//	                      |ГДЕ
//	                      |	СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	                      |
//	                      |СГРУППИРОВАТЬ ПО
//	                      |	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура,
//	                      |	СебестоимостьТоваров.Период
//	                      |
//	                      |УПОРЯДОЧИТЬ ПО
//	                      |	СебестоимостьТоваров.Период УБЫВ";
//	

//	
//	РезультатП = ЗапросПоступл.Выполнить();
//	ТабП = РезультатП.Выгрузить(СпособОбхода); 
//	
//	Для Каждого стр из Таб Цикл
//		Отбор = Новый Структура;
//		Отбор.Вставить("ОбъектРасчетов",стр.ЗаказыКлиентов);
//		Строки = ТабОпл.НайтиСтроки(Отбор);
//		Если Строки.Количество() >=1 Тогда
//			стр.Оплата = Строки[0].СуммаОплаты;
//		КонецЕсли;
////		
//		Отбор = Новый Структура;
//		Отбор.Вставить("ОснованиеПлатежа",стр.ЗаказыКлиентов);
//		Строки = ТабОпл.НайтиСтроки(Отбор);
//		Если Строки.Количество() >=1 Тогда
//			стр.Оплата = Строки[0].СуммаОплаты;
//		КонецЕсли;
////      
//Закупка = 0;     
//Если ТипЗнч(стр.ЗаказыКлиентов) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
//Для Каждого строка из стр.ЗаказыКлиентов.Товары Цикл
//		ОтборП = Новый Структура;
//		ОтборП.Вставить("Номенклатура",строка.Номенклатура);
//		СтрокиП = ТабП.НайтиСтроки(ОтборП);
//		Если СтрокиП.Количество() >=1 Тогда 
//			Закупка = Закупка + строка.Количество * Окр(СтрокиП[0].Стоимость/СтрокиП[0].Количество,2);
//		КонецЕсли;

//	КонецЦикла;
//	стр.Закупка =Закупка; 
//	КонецЕсли;
//   КонецЦикла;
//	
//	Возврат Таб;
//КонецФункции  

//&НаКлиенте
//Процедура Сформировать(Команда)  
//	ПродажиМенеджерНаСервере();
//	
//КонецПроцедуры
//	
//	
//&НаСервере
//Процедура ПродажиМенеджерНаСервере()
//	ДанныеРасшифровки = Неопределено;
//	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
//	Обработка =  РеквизитФормыВЗначение("Объект");
//	МакетДокумента = Обработка.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); 	
//	
//	КомпоновщикНоменклатура = Новый КомпоновщикНастроекКомпоновкиДанных;
//	КомпоновщикНоменклатура.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(МакетДокумента));
//	КомпоновщикНоменклатура.ЗагрузитьНастройки(МакетДокумента.НастройкиПоУмолчанию);

//	КомпоновщикНоменклатура.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", Период);
//	
//	//
//	МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетДокумента, КомпоновщикНоменклатура.ПолучитьНастройки(), ДанныеРасшифровки);
//	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
//	
//	ТабПродаж = НаборПродаж();
//	
//	ВнешниеНаборыДанных = Новый Структура("ТабПродаж", ТабПродаж);
//	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);

//	ПродажиРезультат.Очистить();
//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//	ПроцессорВывода.УстановитьДокумент(ПродажиРезультат);			// Выбор выходного табличного документа.
//	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
//	ПродажиРезультат.ПоказатьУровеньГруппировокСтрок(0);

//КонецПроцедуры


