
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	СК_Инвентаризация.Номенклатура КАК Номенклатура,
|	СК_Инвентаризация.Ячейка КАК Ячейка
|ИЗ
|	РегистрСведений.СК_Инвентаризация КАК СК_Инвентаризация
|
|СГРУППИРОВАТЬ ПО
|	СК_Инвентаризация.Номенклатура,
|	СК_Инвентаризация.Ячейка";
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	ЗапросНом = Новый ЗАпрос;
	ЗапросНом.Текст = "ВЫБРАТЬ
	                  |	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	                  |	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
	                  |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	                  |ИЗ
	                  |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки(&Дата) КАК СК_ТоварыНаСкладахОстатки
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	СК_ТоварыНаСкладахОстатки.Номенклатура,
	                  |	СК_ТоварыНаСкладахОстатки.Ячейка,
	                  |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток"; 
	ЗАпросНом.УстановитьПараметр("Дата",Дата("10.12.2025 23:59:59"));
	РезНом = ЗапросНом.Выполнить().Выгрузить();  
	Док = ЭтотОбъект.ДокКорректировка.ПолучитьОбъект(); 
	Для Каждого стр из РезНом Цикл 
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",стр.Номенклатура);
		Отбор.Вставить("Ячейка",стр.Ячейка);  
		
		Строки = Рез.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 ТОгда
			Т = Док.Товары.Добавить();
			Т.Номенклатура = стр.Номенклатура;
			Т.Количество = стр.ВналичииОстаток;
			Т.Ячейка = стр.Ячейка;
			Т.ВидДвижения = Перечисления.ВидыДвиженияНакопления.Расход;
		КонецЕсли;
	КонецЦикла;
	Док.Записать(РежимЗаписиДокумента.Запись);	
	
	
КонецПроцедуры

