Функция ДокументСписание(Распоряжение) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	СК_СписаниеСклад.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СК_СписаниеСклад КАК СК_СписаниеСклад
	|ГДЕ
	|	СК_СписаниеСклад.ДокументОснования = &ДокументОснования
	|	И СК_СписаниеСклад.Проведен = &Проведен
	|	И СК_СписаниеСклад.ПометкаУдаления = &ПометкаУдаления";	
	
	Запрос.УстановитьПараметр("ДокументОснования", Распоряжение);
	Запрос.УстановитьПараметр("Проведен", Истина);
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
