
&НаКлиенте
Процедура СК_ЗаданиеНаПечатьПосле(Команда) 
	
	ДокПечать = СК_ЗаданиеНаПечатьНаСервере();
	
	Если ДокПечать <> Ложь Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДокСсылка", ДокПечать);
		
		Оповещение = Новый ОписаниеОповещения("ОтветНаВопросЗавершение", ЭтотОбъект,ПараметрыФормы);
		ТекстВопроса = "Задание создано, открыть печать этикеток?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		Сообщить("Ошибка записи");	
	КонецЕсли;
	
КонецПроцедуры  


&НаКлиенте 
Процедура ОтветНаВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьФорму("Обработка.ПечатьЭтикетокИЦенников.Форма", ДополнительныеПараметры); 				
	КонецЕсли;
КонецПроцедуры   

&НаСервере
Функция СК_ЗаданиеНаПечатьНаСервере()

	Док = Документы.СК_ЗаданиеНаПечать.СоздатьДокумент();  
	Док.Дата = ТекущаяДата();
	Док.Выполнено = Ложь; 
	Док.СсылкаДокумент = Объект.Ссылка;
	ТЧ = Объект.Товары.Выгрузить();
	Док.Товары.Загрузить(ТЧ);
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		нДок = Док.Ссылка;
		Возврат нДок;
	Исключение
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт
	
	
КонецПроцедуры

&НаКлиенте
Процедура СК_ПринятьНаСкладВместо(Команда)
	Если Объект.СК_ОснованиеТСД.Пустая() = Истина Тогда  
		Оповещение = Новый ОписаниеОповещения("СоздатьПерезаполнитьДокументПриема", ЭтотОбъект);
		ТекстВопроса = "Выполнить прием товара на склад";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе 
		Оповещение = Новый ОписаниеОповещения("СоздатьПерезаполнитьДокументПриема", ЭтотОбъект);
		ТекстВопроса = "Перезаполнить документ приема на склад";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры 


&НаКлиенте 
Процедура СоздатьПерезаполнитьДокументПриема(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да Тогда
		СоздатьПриемТовараНаСклад(); 				
	КонецЕсли;
КонецПроцедуры   



&НаСервере
Процедура СоздатьПриемТовараНаСклад()
	
	ТЧ = Объект.Товары.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Номенклатура В(&Номенклатура)";
	ТЧ.Свернуть("Номенклатура");
	Запрос.УстановитьПараметр("Номенклатура",ТЧ);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() <> ТЧ.Количество() Тогда
		Сообщить("Не для всех позиций заполнен штрихкод, создайте задание на печать этикеток");
	Иначе
		Если Объект.СК_ОснованиеТСД = Документы.СК_ПоступлениеСклад.ПустаяСсылка() Тогда
			Док = Документы.СК_ПоступлениеСклад.СоздатьДокумент();
		Иначе
			Док = Объект.СК_ОснованиеТСД.ПолучитьОбъект();
		КонецЕсли;

		Док.Товары.Очистить();
		
		Док.Дата = ТекущаяДата();

		ТЧ = Объект.Товары.Выгрузить();
		ТЧ.Колонки.Добавить("Время",Новый ОписаниеТипов("Дата"));
		ТЧ.Колонки.Добавить("Ячейка",Новый ОписаниеТипов("СправочникСсылка.СК_Ячейки"));
		ТЧ.ЗаполнитьЗначения(Справочники.СК_Ячейки.НайтиПоРеквизиту("ШтрихКод","0000000000001").Ссылка, "Ячейка");
		ТЧ.ЗаполнитьЗначения(ТекущаяДата(), "Время");
		Док.Товары.Загрузить(ТЧ);

		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Объект.СК_ОснованиеТСД = Док.Ссылка;
		Исключение
			Сообщить("При создании документа произошла ошибка");
		КонецПопытки; 
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура СК_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	Если РольДоступна("ПолныеПрава") Тогда
		
	Иначе
		Если Объект.СК_ОснованиеТСД <> Документы.СК_ПоступлениеСклад.ПустаяСсылка() Тогда
			ЭтаФорма.Элементы.СК_ОснованиеТСД.Доступность = Ложь; 
			ЭтаФорма.Элементы.Товары.ИзменятьПорядокСтрок = Ложь;
			ЭтаФорма.Элементы.Товары.ИзменятьСоставСтрок = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


