
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Попытка
		Движения.СК_ТоварыНаСкладах.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.СК_ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Ячейка = ТекСтрокаТовары.ЯчейкаОтправитель;
			Движение.Вналичии = ТекСтрокаТовары.Количество;
		КонецЦикла;
	//Исключение  
	//	Сообщить("Не Списано");
	//КонецПопытки;
	
	// регистр СХК_ТоварыНаСкладе Приход
	//Попытка
		Движения.СК_ТоварыНаСкладах.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.СК_ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Ячейка = ТекСтрокаТовары.ЯчейкаПриемник;
			Движение.Вналичии = ТекСтрокаТовары.Количество;
		КонецЦикла;
	//Исключение
	//	Сообщить("Не удалось выполнить перемещение");
	//КонецПопытки;

КонецПроцедуры
