  Функция СведенияОВнешнейОбработке() Экспорт 
	РегистрационныеДанные = Новый Структура; 
	РегистрационныеДанные.Вставить("Наименование", "Контроль склад факт/учет"); 
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь); 
	РегистрационныеДанные.Вставить("Версия", "1.01"); 
	РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет"); 
	РегистрационныеДанные.Вставить("Информация", "Контроль склад факт/учет"); 
 ///////////// команды ///////////////////////// 
	тзКоманд = Новый ТаблицаЗначений; 
	тзКоманд.Колонки.Добавить("Идентификатор"); 
	тзКоманд.Колонки.Добавить("Представление"); 
	тзКоманд.Колонки.Добавить("Модификатор"); 
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение"); 
	тзКоманд.Колонки.Добавить("Использование"); 
	строкаКоманды = тзКоманд.Добавить(); 
	строкаКоманды.Идентификатор = "1"; 
	строкаКоманды.Представление = "Контроль склад факт/учет"; 
	строкаКоманды.ПоказыватьОповещение = Истина; 
	строкаКоманды.Использование = "ОткрытиеФормы"; 
	РегистрационныеДанные.Вставить("Команды", тзКоманд); 
	Возврат РегистрационныеДанные; 
КонецФункции
