
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКНоменклатуры;
КонецПроцедуры

&НаСервере
Процедура ШКИзменениеТекстаРедактированияНаСервере(ШК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	Запрос.УстановитьПараметр("Штрихкод",ШК);
	Рез = Запрос.Выполнить().Выгрузить();

	Если Рез.Количество()=1 Тогда
		Инф = Строка(Рез[0].Номенклатура)+ Символы.ПС;
		
		ЗапросОбщ = Новый Запрос;
		ЗапросОбщ.Текст = "ВЫБРАТЬ
		                  |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
		                  |ИЗ
		                  |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		                  |ГДЕ
		                  |	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура"; 
		ЗапросОбщ.УстановитьПараметр("Номенклатура",Рез[0].Номенклатура);
		РезОбщ = ЗапросОбщ.Выполнить().Выгрузить();
		
		Если РезОбщ.Количество()>=1 Тогда
			Инф = Инф + "Общий остаток:" + Строка(РезОбщ[0].ВНаличииОстаток)+" "+Рез[0].Номенклатура.ЕдиницаИзмерения + Символы.ПС;		
		КонецЕсли; 
		
		ЗапросЯчейки = Новый Запрос;
		ЗапросЯчейки.Текст = "ВЫБРАТЬ
		                     |	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
		                     |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
		                     |ИЗ
		                     |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
		                     |ГДЕ
		                     |	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура";
		ЗапросЯчейки.УстановитьПараметр("Номенклатура",Рез[0].Номенклатура);
		РезЯч = ЗапросЯчейки.Выполнить().Выгрузить();
		
		Если РезЯч.Количество()>=1 Тогда 
			Инф = Инф + "Остатки по ячейкам:"+ Символы.ПС;
			Для Каждого стр из РезЯч  Цикл
				Инф = Инф + Строка(стр.Ячейка)+" -  "+Строка(стр.ВналичииОстаток)+" "+Рез[0].Номенклатура.ЕдиницаИзмерения+ Символы.ПС;
	
			КонецЦикла;
		КонецЕсли;	
		
		
		ЭтаФорма.Элементы.Информация.Заголовок = Инф;
		ЭтаФорма.Элементы.Ошибка.Заголовок = "";
	Иначе 
		ЭтаФорма.Элементы.Ошибка.Заголовок = "Номенклатура не найдена";
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ШКИзменениеТекстаРедактированияНаСервере(Текст);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ШКНоменклатуры.РедактированиеТекста = Истина;
	АктивироватьПоиск();

КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.ШКНоменклатуры.ОбновитьТекстРедактирования();
	Элементы.ШКНоменклатуры.Видимость = Ложь;
	Элементы.ШКНоменклатуры.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКНоменклатуры; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ШКНоменклатуры = "";
КонецПроцедуры
