
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);

	Если СтруктураПараметров.Ссылка <> "" Тогда
		ДокВП = НайтиСоздатьДокументСборки(СтруктураПараметров.Ссылка);
		Если ДокВП = Ложь Тогда
			Сообщить("Не удалось создать документ сборки");	
		Иначе
			ЗаполнитьТабТовары(ДокВП);
		КонецЕсли;
	Иначе
		Сообщить("Не удалось создать документ отгрузки");	
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Функция НайтиСоздатьДокументСборки(Док)
	
	ДокСборки = Ложь;
	
	Если ТипЗНЧ(Док) = ТИП("ДокументСсылка.ЗаказНаСборку") Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	СборкаТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СборкаТоваров КАК СборкаТоваров
		|ГДЕ
		|	СборкаТоваров.ЗаказНаСборку = &ЗаказНаСборку
		|	И СборкаТоваров.ПометкаУдаления = &ПометкаУдаления
		|	И СборкаТоваров.Проведен = &Проведен";
		Запрос.УстановитьПараметр("ЗаказНаСборку",Док);
		Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
		Запрос.УстановитьПараметр("Проведен",Истина);  
		
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Следующий() Тогда  
			ДокСборки = Рез.Ссылка;
		Иначе
			СтруктураП = Новый Структура;
			СтруктураП.Вставить("ЗаполнятьПоОрдеру",Ложь);
			СтруктураП.Вставить("ПоЗаказуНаСборку",Истина);
			СтруктураП.Вставить("ИмяДокумента","СборкаТоваров");
			СтруктураП.Вставить("Дата",ТекущаяДата());
			СтруктураП.Вставить("ИмяПоляЗаказ","ЗаказНаСборку");
			СтруктураП.Вставить("ИмяРегистраЗаказ","ЗаказыНаСборку");
			СтруктураП.Вставить("КлючевыеПоля","Номенклатура, Характеристика, Серия, Назначение");

			МассивЗаказов = Новый Массив;
			МассивЗаказов.Добавить(Док.Ссылка);
			СтруктураП.Вставить("МассивЗаказов",МассивЗаказов);
			
			Ресурсы = Новый Массив;
			Ресурсы.Добавить("Комплект");
			Ресурсы.Добавить("Комплектующие");
			СтруктураП.Вставить("Ресурсы",Ресурсы);
			
			РеквизитыШапки = Новый Структура; 
			РеквизитыШапки.Вставить("ВариантПриемкиТоваров",Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным);
			РеквизитыШапки.Вставить("Организация",Док.Ссылка.Организация);
			РеквизитыШапки.Вставить("Подразделение",Док.Ссылка.Подразделение);
			РеквизитыШапки.Вставить("СборкаПодДеятельность",Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);//Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции"));
			РеквизитыШапки.Вставить("Склад",Док.Ссылка.Склад);
			РеквизитыШапки.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.СборкаТоваров);

			СтруктураП.Вставить("РеквизитыШапки",РеквизитыШапки);
			ДокП = Документы.СборкаТоваров.СоздатьДокумент();
			ДокП.Заполнить(СтруктураП);
			ДокП.Дата = ТекущаяДата();
			ДокП.Ответственный = Док.Автор;
			ДокП.Записать(РежимЗаписиДокумента.Проведение);
			
			ДокСборки = ДокП.Ссылка; 
		КонецЕсли;
		
	ИначеЕсли ТипЗНЧ(Док) = ТИП("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВнутреннееПотребление.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВнутреннееПотребление КАК ВнутреннееПотребление
		|ГДЕ
		|	ВнутреннееПотребление.ЗаказНаВнутреннееПотребление = &ЗаказНаСборку
		|	И ВнутреннееПотребление.ПометкаУдаления = &ПометкаУдаления
		|	И ВнутреннееПотребление.Проведен = &Проведен";
		Запрос.УстановитьПараметр("ЗаказНаСборку",Док);
		Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
		Запрос.УстановитьПараметр("Проведен",Истина);  
		
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Следующий() Тогда  
			//ДокСборки = Рез.Ссылка;
			ДСборки = Рез.Ссылка.ПолучитьОбъект();
			ДСборки.Товары.Очистить();
			ТДок = Док.Товары.Выгрузить();
			ДСборки.Товары.Загрузить(ТДок);
			ДСборки.Записать(РежимЗаписиДокумента.Проведение); 
			ДокСборки = ДСборки.Ссылка;
		Иначе
			СтруктураП = Новый Структура;
			СтруктураП.Вставить("ЗаполнятьПоОрдеру",Ложь);
			СтруктураП.Вставить("ПоЗаказуНаСборку",Истина);
			СтруктураП.Вставить("ИмяДокумента","ВнутреннееПотребление");
			СтруктураП.Вставить("Дата",ТекущаяДата());
			СтруктураП.Вставить("ИмяПоляЗаказ","ЗаказНаВнутреннееПотребление");
			СтруктураП.Вставить("ИмяРегистраЗаказ","ЗаказыНаВнутреннееПотребление");
			СтруктураП.Вставить("КлючевыеПоля","Номенклатура, Характеристика, Серия, Назначение");
			СтруктураП.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию);

			МассивЗаказов = Новый Массив;
			МассивЗаказов.Добавить(Док.Ссылка);
			СтруктураП.Вставить("МассивЗаказов",МассивЗаказов);
			
			
			РеквизитыШапки = Новый Структура; 
			РеквизитыШапки.Вставить("ВариантПриемкиТоваров",Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным);
			РеквизитыШапки.Вставить("Организация",Док.Ссылка.Организация);
			РеквизитыШапки.Вставить("Подразделение",Док.Ссылка.Подразделение);
			РеквизитыШапки.Вставить("СборкаПодДеятельность",Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);//Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции"));
			РеквизитыШапки.Вставить("Склад",Док.Ссылка.Склад);
			РеквизитыШапки.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию);
			РеквизитыШапки.Вставить("Ответственный",Док.Автор);
			
			СтруктураП.Вставить("РеквизитыШапки",РеквизитыШапки);
			ДокП = Документы.ВнутреннееПотребление.СоздатьДокумент();
			ДокП.Заполнить(СтруктураП);
			ДокП.Дата = ТекущаяДата();
			ДокП.Ответственный = Док.Автор;
			ДокП.Записать(РежимЗаписиДокумента.Проведение);
			
			ДокСборки = ДокП.Ссылка; 
		КонецЕсли;
		
	Иначе
		
	КонецЕсли;
	
	Возврат  ДокСборки;

КонецФункции



&НаСервере
Процедура ЗаполнитьТабТовары(Док)
	
	ТабТовары.Очистить();
	
	СКСписание = НайтиДокСписания(Док);
	ВТЧ = Док.Товары.Выгрузить(); 
	
	Если СКСписание.Пустая() = Истина Тогда
		НовыйДок = Документы.СК_СписаниеСклад.СоздатьДокумент();  
		НовыйДок.Дата = ТекущаяДата();
		НовыйДок.ДокументОснования = Док;
		НовыйДок.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран;
	Иначе
 		НовыйДок = СКСписание.ПолучитьОбъект();
		Если НовыйДок.Товары.Количество() <> ВТЧ.Количество() Тогда 
			НовыйДок.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран;
		КонецЕсли;
		
	КонецЕсли;
	
	НовыйДок.Товары.Очистить();
	НовыйДок.Товары.Загрузить(ВТЧ); 
	
	Попытка
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение); 
		Д = НовыйДок;
		ЭтаФорма.ДокОсн = Д.Ссылка;
	Исключение
		Сообщить("Не удалось создать документ отгрузки");	
	КонецПопытки;
	
	ОбновитьТабТовары();
	
КонецПроцедуры


&НаСервере
Функция НайтиДокСписания(Док)	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_СписаниеСклад.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СК_СписаниеСклад КАК СК_СписаниеСклад
	               |ГДЕ
	               |	СК_СписаниеСклад.ПометкаУдаления = &ПометкаУдаления
	               |	И СК_СписаниеСклад.Проведен = &Проведен
	               |	И СК_СписаниеСклад.ДокументОснования = &ДокументОснования";
	
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	Запрос.УстановитьПараметр("Проведен",Истина);
	Запрос.УстановитьПараметр("ДокументОснования",Док);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Документы.СК_СписаниеСклад.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОбновитьТабТовары()
	
	ТабТовары.Очистить();
	
	ВТЧТовары = ЭтаФорма.ДокОсн.Товары.Выгрузить();
	ВТЧСобрано = ЭтаФорма.ДокОсн.СобранныеТовары.Выгрузить();
	ВТЧСобрано.Свернуть("Номенклатура","Количество");
	ТабТовары.Загрузить(ВТЧТовары);
	
	Для Каждого стр из ТабТовары Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",стр.Номенклатура);
		Строки = ВТЧСобрано.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда
			стр.КоличествоСобрано = Строки[0].Количество; 
		КонецЕсли;
	КонецЦикла; 
	//
	Отбор = Новый Структура;
	Отбор.Вставить("Собран",Ложь);
	
	ПСтроки = ТабТовары.НайтиСтроки(Отбор);
	Если ПСтроки.Количество() = 0 Тогда  
		Док = ДокОсн.ПолучитьОбъект(); 
		//Если Док.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран Тогда 
			
			ДокУчет = Док.ДокументОснования.ПолучитьОбъект();
 			
			Если ТипЗНЧ(ДокУчет) = ТИП("ДокументОбъект.СборкаТоваров") Тогда
				Если ДокУчет.Статус = Перечисления.СтатусыСборокТоваров.ВРаботе Тогда
					ДокУчет.Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано; 
					ДокУчет.Записать(РежимЗаписиДокумента.Проведение); 
					ДокЗаказа = ДокУчет.ЗаказНаСборку.ПолучитьОбъект();
					ДокЗаказа.Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт;
					ДокЗаказа.Записать(РежимЗаписиДокумента.Проведение); 
					
				КонецЕсли;
			ИначеЕсли ТипЗНЧ(Док) = ТИП("ДокументСсылка.ВнутреннееПотребление") Тогда  
				
			КонецЕсли;
			
			//Док.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран;
			//Док.Записать(РежимЗаписиДокумента.Проведение);  
			
		//КонецЕсли;
		
		Если Док.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран Тогда 
			ЭтаФорма.Элементы.ГруппаТоваров.Доступность = Ложь;
		КонецЕсли;
		
		ЭтаФорма.Элементы.Собран.Заголовок = "Документ собран";
	КонецЕсли;
	ТабТовары.Сортировать("Собран ВОЗР");
КонецПроцедуры

&НаКлиенте
Процедура ТабТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыФормыОстатки = Новый Структура;     
	ПараметрыФормыОстатки.Вставить("Ссылка",ДокОсн);
	ПараметрыФормыОстатки.Вставить("Номенклатура",Элемент.ТекущиеДанные.Номенклатура);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.СК_МобСклад.Форма.ФормаСборкиЗаказа", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры    

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(Значение, ДопПараметры) Экспорт
	ОбновитьТабТовары();	
КонецПроцедуры

