
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыбраннаяЯчейка = Новый Массив;
	Ряд = Новый Массив;
	Секция = Новый Массив; 
	
	Список.Параметры.УстановитьЗначениеПараметра("Ряд",Ряд);
	Список.Параметры.УстановитьЗначениеПараметра("Секция",Секция);
	ОбновитьТаб();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаб()
    Схема = ЭтаФорма.Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = ЭтаФорма.Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ТаблицаРезультат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Таб.Очистить();                         
	
	Если ТаблицаРезультат.Количество() >=1 Тогда
		Для Каждого стр из ТаблицаРезультат Цикл
			Т = Таб.Добавить();
			Т.Ссылка = стр.Ссылка;
			Т.Код = стр.Ссылка.Код;
		КонецЦикла;
	КонецЕсли;
	Таб.Сортировать("Код Возр");
	
КонецПроцедуры      


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСекции();
	ЗаполнитьРяды();
КонецПроцедуры      

&НаСервере
Процедура ЗаполнитьСекции()
	
		ЗапросУп = Новый Запрос;
		ЗапросУп.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                 |	СК_Ячейки.Секция КАК Секция
		                 |ИЗ
		                 |	Справочник.СК_Ячейки КАК СК_Ячейки
		                 |ГДЕ
		                 |	СК_Ячейки.ПометкаУдаления = &ПометкаУдаления"; 
		ЗапросУп.УстановитьПараметр("ПометкаУдаления",Ложь);
		РезультатЗапросаУп = ЗапросУп.Выполнить();
				
		СписокУпаковок = Новый СписокЗначений; 
		СписокУпаковок.Очистить();
		СписокУпаковок.ЗагрузитьЗначения(РезультатЗапросаУп.Выгрузить().ВыгрузитьКолонку("Секция"));		
		ЭтаФорма.Элементы.Секция.СписокВыбора.ЗагрузитьЗначения(СписокУпаковок.ВыгрузитьЗначения());
//

	КонецПроцедуры 
	
&НаСервере
Процедура ЗаполнитьРяды()
		ЗапросУп = Новый Запрос;
		ЗапросУп.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                 |	СК_Ячейки.Ряд КАК Ряд
		                 |ИЗ
		                 |	Справочник.СК_Ячейки КАК СК_Ячейки
		                 |ГДЕ
		                 |	СК_Ячейки.ПометкаУдаления = &ПометкаУдаления"; 
		ЗапросУп.УстановитьПараметр("ПометкаУдаления",Ложь);
		РезультатЗапросаУп = ЗапросУп.Выполнить();
				
		СписокУпаковок = Новый СписокЗначений; 
		СписокУпаковок.Очистить();
		СписокУпаковок.ЗагрузитьЗначения(РезультатЗапросаУп.Выгрузить().ВыгрузитьКолонку("Ряд"));		
		ЭтаФорма.Элементы.Ряд.СписокВыбора.ЗагрузитьЗначения(СписокУпаковок.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
Процедура СекцияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
		Список.Параметры.УстановитьЗначениеПараметра("Секция",ВыбранноеЗначение);
		ОбновитьТаб();
КонецПроцедуры

&НаКлиенте
Процедура РядОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
		Список.Параметры.УстановитьЗначениеПараметра("Ряд",ВыбранноеЗначение); 
		ОбновитьТаб();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТаблДокум = ПечатьНаСервере();
	ТаблДокум.Показать("Печать документа"); 

КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()


	ТаблДокум = Новый  ТабличныйДокумент;
    ТаблДокум.Очистить();
	Макет = Справочники.СК_Ячейки.ПолучитьМакет("Макет");  
	Строка = Макет.ПолучитьОбласть("Строка");
	
	
	Для Каждого стр из Таб Цикл   
			Строка.Параметры.Ячейка	 =   СокрЛП(стр.Ссылка.Секция)+" / " +  
										 СокрЛП(стр.Ссылка.Ряд) +" / " + 
										 СокрЛП(стр.Ссылка.Ячейка);
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          112);
			ПараметрыШтрихкода.Вставить("Высота",          75);
			ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(стр.Ссылка.ШтрихКод));
			ПараметрыШтрихкода.Вставить("ТипКода",         2); // EAN13
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    16);
			                     
			Строка.Рисунки.ШтрихКод.Картинка= МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода); 
			ТаблДокум.АвтоМасштаб = Истина;
			ТаблДокум.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;   
			ТаблДокум.ВысотаСтраницы = "70";
			ТаблДокум.ШиринаСтраницы = "100";
			
			ТаблДокум.Вывести(Строка); 
			ТаблДокум.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;
		
	
	Возврат ТаблДокум;
	
КонецФункции   


