Функция ПодключитьсяКбазе() Экспорт
	ПараметрыПодключенияИБ = "Srvr="""+Строка(Константы.СК_БухСервер.Получить())+"""; Ref="""+Строка(Константы.СК_БухБД.Получить())+"""; Usr="""+Строка(Константы.СК_БухПользователь.Получить())+"""; Pwd="""+Строка(Константы.СК_БухПароль.Получить())+"""";;
	//ПараметрыПодключенияИБ = "Srvr=""homepc""; Ref=""yt11_dev""; Usr=""Администратор""; Pwd=""Aa123456""";;
	V83COMCon= Новый COMОбъект("V83.COMConnector");
	Попытка
	         Возврат V83COMCon.Connect(ПараметрыПодключенияИБ);
	Исключение
	         Сообщить(ОписаниеОшибки());
	         Возврат Неопределено;
	КонецПопытки;
КонецФункции
