
&НаСервере
Процедура СК_ПриОткрытииПослеНаСервере()
	ТабЯчейки.Очистить();
	ТабЯчейки.Загрузить(СК_ОстаткиЯчейки.ОстатокПоЯчейкам(Объект.Ссылка)); 
	ЭтаФорма.Склад = Справочники.Склады.НайтиПоНаименованию("Основной склад");
	ЗаполнитьОстатокПоСкладу();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстатокПоСкладу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ВНаличииОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	ТоварыНаСкладахОстатки.Склад = &Склад
	               |	И ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура";  
	Запрос.УстановитьПараметр("Склад",ЭтаФорма.Склад.Ссылка);
	Запрос.УстановитьПараметр("Номенклатура",Объект.Ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		ЭтаФорма.Элементы.ОстатокНаСкладе.Заголовок = Строка(Рез.ВНаличииОстаток) + " шт";
	Иначе                                            
		ЭтаФорма.Элементы.ОстатокНаСкладе.Заголовок = " 0 шт";
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура СК_ПриОткрытииПосле(Отказ)
	СК_ПриОткрытииПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СК_СкладПриИзмененииПосле(Элемент)
	ЗаполнитьОстатокПоСкладу();
КонецПроцедуры
