
&НаСервере
Процедура СК_ПриОткрытииПослеНаСервере()
	ТабЯчейки.Очистить();
	ТабЯчейки.Загрузить(СК_ОстаткиЯчейки.ОстатокПоЯчейкам(Объект.Ссылка)); 
	ЭтаФорма.Склад = Справочники.Склады.НайтиПоНаименованию("Основной склад");
	ЗаполнитьОстатокПоСкладу(); 
	Если Пользователи.АвторизованныйПользователь().Наименование = "Администратор" Тогда
		Элементы.ТабЯчейкиОстаток.ТолькоПросмотр = Ложь;
		Элементы.ТабЯчейки.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстатокПоСкладу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ВНаличииОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	ТоварыНаСкладахОстатки.Склад = &Склад
	               |	И ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура";  
	Запрос.УстановитьПараметр("Склад",ЭтаФорма.Склад.Ссылка);
	Запрос.УстановитьПараметр("Номенклатура",Объект.Ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		ЭтаФорма.Элементы.ОстатокНаСкладе.Заголовок = Строка(Рез.ВНаличииОстаток) + " шт";
	Иначе                                            
		ЭтаФорма.Элементы.ОстатокНаСкладе.Заголовок = " 0 шт";
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура СК_ПриОткрытииПосле(Отказ)
	СК_ПриОткрытииПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СК_СкладПриИзмененииПосле(Элемент)
	ЗаполнитьОстатокПоСкладу();
КонецПроцедуры

&НаСервере
Функция СК_ТабЯчейкиОстатокПриИзмененииНаСервере(НЧисло,Ячейка) 
	
	Возврат СК_ОстаткиЯчейки.ИзменитьКоличествономенклатураЯчейка(НЧисло,Ячейка,Объект.Ссылка);	
	
КонецФункции
&НаКлиенте
Процедура СК_ТабЯчейкиОстатокПриИзмененииПосле(Элемент) 
	
	Если СК_ТабЯчейкиОстатокПриИзмененииНаСервере(Элементы.ТабЯчейки.ТекущиеДанные.ВналичииОстаток,Элементы.ТабЯчейки.ТекущиеДанные.Ячейка) Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Изменено",5,"Внимание!!!");
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Произошла ошибка",5,"Внимание!!!");
	КонецЕсли;		

КонецПроцедуры    

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Параметры) Экспорт  
	
	СК_ПриОткрытииПослеНаСервере();

КонецПроцедуры 



